{
    "The Brimstone Swamp|Angmar": [
        "* The hunting-camp of Tyrn Lhuig is located at [1.9S, 33.2W]."
    ],
    "Sending a Message|Mirkwood": [
        "* Ukhurk's Standard is in Garmadh-maudhûl at [16.6S, 46.7W]"
    ],
    "The Choicest Cut|Forochel": [
        "* Silvan Thirty-Point is southwest of the lake"
    ],
    "Instance: The Defence of Trestlebridge|North Downs": [
        "* Watch Nellie Boskins or else she will die from the mobs"
    ],
    "Bogrian's Curiosity|Moria Upper Levels": [
        "* The Morvul-scouts you must spy upon are in The Fanged Pit at [2.4S, 102.5W]"
    ],
    "Dark Relics|Mirkwood": [
        "* The Accursed Dagger is in Sâd Morangol at [19.1S, 48.8W]\n* The Accursed Cup is in Sâd Morangol at [19.4S, 48.3W]\n* The Accursed Staff is carried by one of the Sorcerers in Sâd Morangol"
    ],
    "Silken Strands|Angmar": [
        "* The Spiders are found along the road just to the east of the Earth-kin camp. They seem to share spawn locations with the Hill-claws, so you may need to defeat some of those to get them to spawn."
    ],
    "Meat for the Hungry|North Downs": [
        "* Kill aurochs scattered in the eastern Nan Amlug and Rhunenland."
    ],
    "Remaining Goods|Eregion": [
        "* Satchels can be found at:\n[40.6S, 10.3W]\n* [40.7S, 10.4W]\n* [40.8S, 10.3W]\n* [40.8S, 10.5W]\n* [40.7S, 10.6W]\n* [40.6S, 10.7W]\n* Crates can be found at:\n[40.6S, 10.2W]\n* [40.5S, 10.1W]\n* [40.6S, 10.3W]\n* [40.8S, 10.4W]\n* [40.8S, 10.4W]"
    ],
    "Pembar's Relics|Eregion": [
        "* Pembar is at [44.1S, 10.8W]"
    ],
    "Book 2, Chapter 1: Rise of the Orcs|Epic - Vol. I, Book 2: The Red Maid": [
        "* The Orcs to kill are just southwest of Candaith's camp at Glumhallow"
    ],
    "Expedition: Bridging the Gap|Mirkwood": [
        "* The western bridge can be found in the Mirk-eaves at [16.9S, 61.4W]\n* The eastern bridge can be found in the Mirk-eaves at [17.0S, 60.1W]"
    ],
    "Old Bauman's Farm|Bree-land": [
        "* Go right up the path, it will divide in to 2 paths. Choose the left one as it is usually easier to see/access the house. His farm is located right on top of a hill. Killing the Blackwold Supervisor will drop Sally's Chain."
    ],
    "Out of the South|Eregion": [
        "* Angmarim Scouts drop the symbol"
    ],
    "Optional Objective: Bog-lurkers|Garth Agarwen": [
        "* Kill all bog-lurkers. There should be enough bog-lurkers."
    ],
    "Book 2, Chapter 16: Agamaur Secured|Epic - Vol. I, Book 2: The Red Maid": [
        "* Talk to Radagast the Brown in his tower in the back of Ost Guruth"
    ],
    "Free the Fallen|Fornost": [
        "* Quest-giver, Emma Slee, is found in the Fornost Free Peoples' Camp\n* These reside in skeletons in the middle area of the ]. However, some skeletons (~60-75%) contain aggressive (enemy) shades which will attack the player. To release a shade for this quest, a player must walk near the skeleton. When the shade appears on the screen, it will either attack or it will fulfill the quest requirements. The player must click on the shade to complete its release.\n* Each shade will grant quest credit to only the player who clicks on it, not to all members of a fellowship. Thus, a six-person fellowship needs to release a total of 180 friendly shades to complete the quest. With the spawn rate near 1 in 3 or 1 in 4, this means that, on average, 500-700 shades must be released, and most will attack the players and need to be defeated. Statistically, this means the quest will likely require multiple visits to the instance in order successfully release the 30 shades required per person."
    ],
    "Optional Objective: Decayed|Garth Agarwen": [
        "* The Decayed are located at the metal gates that drop down. There are three: one near the beginning and two in the back."
    ],
    "Ancient Lair|Angmar": [
        "* Bethad is inside Ologfil"
    ],
    "Present Yourself to the Chieftain|Angmar": [
        "* Crannog is at [0.1S, 40.2W]"
    ],
    "The Lost Map|North Downs": [
        "* The chest with the map is inside a tent in Thurûm [4.9S, 45.5W]\n* Or kill Foreman Nyrad for it."
    ],
    "The First Gear|Ered Luin": [
        "* The Winterheight is in Thorin's Gate at [15.8S, 101.7W]\n* The gear is inside a chest at the bottom of the cave."
    ],
    "Friendships Renewed|Bree-land": [
        "* Talk to Lolo Wendingway"
    ],
    "Crannog's Fourth Challenge|Angmar": [
        "* Feradakh is at [0.2S, 39.8W]\n* Fonghala is at [0.1N, 39.2W]\n* Moridac is at [0.1N, 40.1W]"
    ],
    "Oakheart's Flight|Fornost": [
        "* Sara Oakheart is found in a prison pen directly north of the Fornost entrance\n* Escort Sara Oakheart. As with Oakheart's Plight, she will go in the middle of mob groups so watch out."
    ],
    "The Wild Hunt|Enedwaith": [
        "* A hidden entrance, covered by trees across the river at [72.8S, 24.0W]\n* The portal close to Tûm at [69.2S, 22.3W]"
    ],
    "Of Mountains and Tempers|Eregion": [
        "* Defeat Freezing Grim and Cave Snow-beast at the Redhorn Snowfall [46.9S, 2.1W]"
    ],
    "Instance: The Hunter's Path|Hunter": [
        "* This is a solo quest, and cannot be completed with a Fellowship"
    ],
    "Riddles in the Tomb|Moria Upper Levels": [
        "* The answer to the first riddle is Bridge. There is Plaque with a bridge in it in the same Chamber of Mazarbul at [4.9S, 105.4W]\n* To complete the quest, you must go outside Moria through the eastern gate to Lothlórien."
    ],
    "An Unseen Hand|Eregion": [
        "* The Pembar Mustering-horn can be found at [44.1S, 10.7W]"
    ],
    "Men of the South|Eregion": [
        "* Dunlendings are around Porth Cadlus"
    ],
    "Rumming's Ridiculous Request|Evendim": [
        "* The answer to the riddle is \"the bat\". The Chest of the Bat can be found at [12.7S, 72.1W]"
    ],
    "Gain and Glory: Assist the Rich|Frostbluff": [
        "* Talk to Winston Goodnough.\n* Talk to Gareth Rust.\n* Talk to Daley Utteridge.\n* Do the emotes.\n* Report back to the mayor.\n* Go to south Frostbluff and sound the Summoning Horn.\n* Defeat Gareth Rust.\n* Return to the mayor."
    ],
    "Book 6, Chapter 7: Beyond Light and Knowledge|Epic - Vol. II, Book 6: The Shadowy Abyss": [
        "* You will find a Burned Hat by The Bridge-shard [14.1S, 97.5W]\n* You will find some Burned Rubble where the stairs did collapse in The Endless Stair [14.7S, 99.0W]\neven though the quest states to search the bottom of the endless stair the rubble is at the top of the stairs."
    ],
    "Book 6, Chapter 1: Of Golodir and Angmar|Epic - Vol. I, Book 6: Fires in the North": [
        "* Go to Daervunn at Esteldín in the North Downs"
    ],
    "Intro:  Skorgrím's Tomb|Introduction": [
        "* This is a solo quest, and cannot be completed in a fellowship.\n* Talk to Dwalin and enter Skorgrím's Tomb\n* Complete the instance\n* Talk to Skògi"
    ],
    "Unconvincing Innocence|Mirkwood": [
        "* There is a Condemned Villager in Audaghaim who will speak with you. He is at [13.8S, 54.9W]"
    ],
    "The Goblins' Treasure|Angmar": [
        "* The gems can be looted from goblins and found in chests around Bail Róva [0.0N, 34.5W] in north-east Ram Dúath. A Small Fellowship is recommended."
    ],
    "A Deal Gone Sour|Lone-lands": [
        "* Pengail is at one of the goblin camps NorthEast of the Forsaken Inn. He will stop at every goblin camp between the one he spawns at and the Inn to check boxes for his fathers sword so be prepared to fight."
    ],
    "Flet-runner Challenge: Leginiel|Lothlórien": [
        "* You have 1 min to find the flet-runner"
    ],
    "A Dark, Secret Way|Eregion": [
        "* Complete quests given by Ruidhriel and Limlaer"
    ],
    "Mirror in the Mire|Moria Lower Deeps": [
        "* The Mirror is in The Lost Palace at [15.1S, 114.8W]"
    ],
    "A Plague of Lizards|Eregion": [
        "* Lizards can be found in Ulundín in the southern tip of Emyn Naer, south-west of Echad Dúnann."
    ],
    "The Puzzle-vault|Ered Luin": [
        "* The stairs are on the right just after the Bard in Thorin's Hall. The levers are just left of Heikki Goldwatcher. The sequence of the levers is: Moon, Axe, Sun, Jewel."
    ],
    "Forest Patrol|Mirkwood": [
        "* The north waypoint is in Emyn Lûm at [13.6S, 51.2W]\n* The north-east waypoint is in Emyn Lûm at [13.7S, 50.0W]\n* The east a waypoint is in Emyn Lûm at [14.5S, 49.5W]\n* The south-east a waypoint is in Emyn Lûm at [14.5S, 49.7W]"
    ],
    "Winter Cleaning|Forochel": [
        "* Kylmä-Säri can be found in Jä-rannit around [17.2N, 66.4W]\n* Tuima-kita can be found in Jä-rannit around [21.0N, 71.8W]"
    ],
    "Rune-kenner|North Downs": [
        "* Gandelin is at Lin Giliath [13.7S, 44.7W]"
    ],
    "Book 1, Expedition: The Top of the Waterfall|Epic - Vol. II, Book 1: The Walls of Moria": [
        "* The strongbox at the top of the waterfall"
    ],
    "Dunland's Champion|Eregion": [
        "* Orders to the White Hand drops from a Dunlending"
    ],
    "The Worm-sire|Eregion": [
        "* Brunanc is found at Carchres [42.2S, 9.3W]"
    ],
    "Task: Great Scales|Task": [
        "*"
    ],
    "Bill's Safe Return|Eregion": [
        "* You must escort Bill the Pony until [52.0S, 9.7W]."
    ],
    "Scout Ânug-stazg|Mirkwood": [
        "* The western campfire is in the Ashenslades around [17.8S, 47.5W]\n* The path to Ânug-stazg in the Ashenslades can be explored around [17.9S, 47.2W]\n* The eastern campfire is in the Ashenslades around [17.9S, 47.0W]"
    ],
    "Unwilling Firewood|Frostbluff": [
        "* In-game typo!  The Grumpwood is actually in the northern reaches."
    ],
    "Song of the Hopeful Heart|Minstrel": [
        "* Erling Goodbody is in Bree at [29.8S, 51.4W]\n* To play a song for Erling Goodbody, just use A special sheet of music that Pada put in your inventory."
    ],
    "Trophies of War|Angmar": [
        "* Duvárdain Berserkers and Duvárdain Sentries are at Tor Gailvin"
    ],
    "Pyres of Dread|Mirkwood": [
        "* There are many Dreadful Pyres south of the river that crosses Taur Morvith, at [18.3S, 50.3W], [18.4S, 50.6W], [18.0S, 50.0W], [18.2S, 49.7W], [18.0S, 49.5W], [18.6S, 49.9W]"
    ],
    "Defeat Darúk|Mirkwood": [
        "* Darúk and his Standard are in Ânghum-maudhûl at [20.1S, 45.9W]"
    ],
    "Stolen Pipe-weed|Bree-land": [
        "* The barrel of pipe-weed is found inside Ost Baranor south of Staddle."
    ],
    "Dark Standards|Angmar": [
        "* Tór Gailvin is at [3.4N, 34.6W]"
    ],
    "Book 1, Chapter 13: The Watcher in the Water|Epic - Vol. II, Book 1: The Walls of Moria": [
        "* Talk to Ráthwald and finish the instance"
    ],
    "Pulling Beards|North Downs": [
        "* Torfi Hammerhorn is at Thurum [4.8S, 45.6W]"
    ],
    "Feeding the Need|Forochel": [
        "* Kill Steppe-elk Hart and Steppe-elk Hind around Zigilgund and in Länsi-mâ"
    ],
    "Building the Bree Homestead|Housing": [
        "* Bill Twiggins is located in the market square of any of the Bree homesteads. Simply choose one and head to the center of the map."
    ],
    "Flet-runner Challenge: Lagordal|Lothlórien": [
        "* You have 2 min to find the flet-runner"
    ],
    "Bloodstones|Angmar": [
        "* Brutal Hill-beasts and Maddened Hill-beasts are in Nád Nathair"
    ],
    "The Matron and the Master|Angmar": [
        "* pending"
    ],
    "Our Greatest Find|Lone-lands": [
        "* The statue drops off random goblins in Minas Eriol. Mobs confirmed to drop this item are White Hand Spear-thrower and White Hand Strong-arm"
    ],
    "Crannog's Third Challenge|Angmar": [
        "* pending"
    ],
    "Crafting: Knowledge is the Best Defence|Crafting": [
        "* Collect Scroll of Minor Battle Lore\n* Collect Scroll of Minor Weaponsmithing Lore"
    ],
    "Murder in the Ruins|Evendim": [
        "* Glirion can be found in the ruins of Arthobel [17.8S, 64.9W]"
    ],
    "Book 2, Chapter 4: Light in the Darkness|Epic - Vol. I, Book 2: The Red Maid": [
        "* Go to the top of Weathertop for the stone"
    ],
    "Stones for the Lodge|Forochel": [
        "* The Mounds where you must place the Bay Stones are at Kaleva's side."
    ],
    "The Fourth Gear|Ered Luin": [
        "* The Chest is in Kheledûl at [21.0S, 92.2W]. To find it, turn left immediately on entering Kheledûl and follow along the wall until you reach it."
    ],
    "Book 1, Chapter 10: Forgotten Lineage|Epic - Vol. II, Book 1: The Walls of Moria": [
        "* Dithalion [28.5S, 6.2W] is by The Forges of Rivendell and Wafi [28.5S, 6.2W] is by The Forging Hall in Thorin's Hall\n* There is a dwarf Forge-master right at his side."
    ],
    "Practised Villainy|Evendim": [
        "* Do alongside Quest:The Thief-takers"
    ],
    "Book 1, Expedition: Unpleasant Business|Epic - Vol. II, Book 1: The Walls of Moria": [
        "* The bone piles are in Filgogân near the mob Graug"
    ],
    "Book 7, Chapter 1: Hidden in Shadow|Epic - Vol. I, Book 7: The Hidden Hope": [
        "* Head north from Gabilshathûr to the hidden refuge of Gath Forthnír\n* Talk to Areneth, then to Lorniel who is in a room inside."
    ],
    "Scouring the Path|Eregion": [
        "* You will find a Pipeweed Pouch at an abandoned camp in the High Hollin area [43.8S, 12.9W]"
    ],
    "Expedition: Lost in the Fray|Mirkwood": [
        "* The desperate soldier is in the Mirk-eaves at [14.1S, 60.5W]\n* The exhausted soldier is in the Mirk-eaves at [14.2S, 59.8W]\n* The wounded soldier is in the Mirk-eaves at [16.0S, 60.5W]"
    ],
    "Planting Anew|Eregion": [
        "* The plots are around Sâd Thareg [42.7S, 16.8W]"
    ],
    "Springing the Traps|Mirkwood": [
        "* When we get close to a trap, you will recognize it as for what it is, and then you can see them more easily.\n* There are plenty of Orc-traps between Maudhûl-ulur and Ashúrz Maufulug at [17.2S, 60.2W], [17.2S, 60.3W], [17.2S, 60.4W], 2 at [17.2S, 60.6W], [17.3S, 60.9W], [17.2S, 61.1W], [17.8S, 61.1W], [17.9S, 61.2W], [17.4S, 60.5W]"
    ],
    "A Fitting Meal|Lone-lands": [
        "* Kill lynx in the Lone-lands"
    ],
    "Lothlórien Preparations III|Lothlórien": [
        "* The Stacks of Supplies can be found outside Caras Galadhon [16.8S, 67.3W]"
    ],
    "Book 7, Chapter 6: Thrór's Hammer|Epic - Vol. I, Book 7: The Hidden Hope": [
        "* Head to the NE corner of Thorin's Gate and enter Skorgrím's Tomb.\n* The first two groups of Wights will have powerful disease effects, so be prepared.\n* Defeat the two groups of two L49-50 Wights per group.\n* Watch out for the trap spikes.  They are easy to recognize and can be timed without difficulty.\n* Head due west until you reach Faerdami, a signature mob with about 4.4K Morale.\n* Defeat Faerdami and loot the hammer.  He restricts the area you can move about in, so it is a close up fight.\n* Return to Litli at Thorin's Hall"
    ],
    "The Shattered Past|Garth Agarwen": [
        "* There are darkwaters inside the Fortress and Arboretum Garth Agarwen instances. They can also be found outside the instance entrances"
    ],
    "Invader's Banners|Eregion": [
        "* Barad Morlas is at [48.1S, 13.7W]\n* The banners can be found at:\n[47.8S, 13.4W]\n* [47.9S, 13.6W]\n* [47.7S, 13.7W]\n* [48.0S, 14.1W]\n* [48.2S, 14.1W]\n* [48.1S, 14.3W]\n* [48.3S, 14.3W]\n* [48.6S, 14.2W]\n* [48.6S, 14.1W]\n* [48.4S, 14.0W]\n* [48.4S, 13.9W]\n* [48.5S, 13.6W]"
    ],
    "The Standing-stone|Ered Luin": [
        "* The Standing Stone is in Emyn Hoedh at [17.9S, 93.4W]\n* You will need to defeat a level 14 signature wight with approximately 600 morale called the Mound-wight Master."
    ],
    "Book 5, Instance: The Battle of the Way of Smiths|Epic - Vol. II, Book 5: Drums in the Deep": [
        "* In the last dialogue, Stóthkell talks about nearly losing Zigilburk. Since the axe has already been lost in Chapter 3, I guess he meant Nâr-khelab, The Heart of Fire."
    ],
    "The Frostbluff Theatre|Frostbluff": [
        "* You should find the fireworks (at the top of the stairs overlooking the Festival square) and set them off first. That will distract the wealthy people, wich you can pickpocket now."
    ],
    "On to Staddle|Bree-land": [
        "* Watcher Redweed is in Staddle, east of Bree"
    ],
    "Through the Gap of Rohan|Eregion": [
        "* The tower on the hill is at [52.7S, 10.6W]"
    ],
    "Intro: The Spies|Introduction": [
        "* Defeat a Blackwold spy, some way south of Dirk Mudbrick, and search him\n* Talk to Dirk Mudbrick\n* Talk to Captain Brackenbrook"
    ],
    "Suspicious by Nature|Eregion": [
        "* The Angmarim Smith that carries the Angmar's Brand can be found in Mirobel around [51.8S, 15.8W]"
    ],
    "Making Mischief|Frostbluff": [
        "* You should find the fireworks (at the top of the stairs overlooking the Festival square) and set them off first. That will distract the wealthy people, wich you can pickpocket now."
    ],
    "The Mysterious Affliction|Mirkwood": [
        "* Check the pools in the Drownholt around [17.4S, 56.1W]"
    ],
    "The Vintage of War|Lothlórien": [
        "* Glasnír can be found just outside the Vinyards of Lórien [18.3S, 64.1W]\n* Belvagor can be found just after you zone in Caras Galadhon [16.1S, 67.0W]"
    ],
    "Lost Goods|Eregion": [
        "* Daegennan is at Gwingris"
    ],
    "Lost My Marbles|Forochel": [
        "* The marbles drop from Peikkos, Tundra Bears, Steppe-elk Harts, and Steppe-elk Hinds"
    ],
    "Missing Arrows|Moria Lower Deeps": [
        "* The Chamber of Dark Waters is at [16.1S, 111.9W]"
    ],
    "Readings from the Basin|Moria Lower Deeps": [
        "* You can collect a water sample at [17.1S, 116.3]"
    ],
    "Songs for the Saplings|Lothlórien": [
        "* Orthir can be found in Cirin-en-galadh at [11.8S, 68.8W]"
    ],
    "Book 7, Chapter 4: Dwarf Mastery|Epic - Vol. I, Book 7: The Hidden Hope": [
        "* Go to Dwalin in Thorin's Hall"
    ],
    "Book 3, Chapter 6, Part II: The Defence of Trestlebridge|Epic - Vol. I, Book 3: The Council of the North": [
        "* Talk to Halbarad and complete the instance [35] The Defence of Trestlebridge\n* Talk to Nellie Boskins when done"
    ],
    "Reporting the Findings|Moria Lower Deeps": [
        "* Jatgír is in The Rotting Cellar at [14.6S, 111.9W]"
    ],
    "The Wolves' Master|Eregion": [
        "* Barad Morlas is at [48.1S, 13.7W]"
    ],
    "Instance: The Innermost Chamber|Moria Lower Deeps": [
        "* This instance is a maze, populated with many mobs, some of them Elite. But if you find your way without missing one turn, you can reach the last chamber without difficulty. Be warned thought, after the last crossroad, there is an \"Indiana Jones\" moment. If you are running, you will die. Keep walking until the trap is revealed and time it to pass it safely.\n* Every passage from a crossroad has a plaque with an engraving. If you follow the passages with the answers to the riddles in your inventory, you will find the correct way in your first try.\n* The answers are Gloves, Heart, Steps, River, Time, Leaf, Map"
    ],
    "Innocence in Peril|Mirkwood": [
        "* Check the Pool of Tranquility around [12.5S, 49.8W]\n* To search the barrows north of the Pool of Tranquility we must check the Scuttledells at [11.3S, 49.9W]\n* There is a backpack in The Dead Grove at [11.8S, 49.5W]"
    ],
    "A Striking Absence of Boar|Evendim": [
        "* The are no boars in Evendim. There is no point in even trying to find them. When the timer runs out, the quest will advance to the next step.\n* It is not necessary to remain in Evendim while the timer finishes. Traveling to another region will not remove the quest from your journal\n* If you log out before the timer runs out, the quest will be removed from your journal."
    ],
    "A False Trail|Eregion": [
        "* You can find a Patch of Grass where to set the false trail in Emyn Naer, at [53.5S, 11.0W]"
    ],
    "A Shadow on the Camp|Mirkwood": [
        "* Defeat goblins in Burgûl-stazg until you find a deserter's note."
    ],
    "Instance: A Captain's Standard|Captain": [
        "* This is a Solo quest, and cannot be completed with a Fellowship.\n* It may be useful to use your Make Haste skill for enough extra speed to complete a difficult jump in the instance, but I can be done without the Make Haste"
    ],
    "Guiding the Shadow|Eregion": [
        "* Dagronk is found wandering at [49.1S, 10.W]"
    ],
    "Book 2, Chapter 8: The Red Swamp|Epic - Vol. I, Book 2: The Red Maid": [
        "* The bog-lurker nests are in the Circle of Blood at Haragmar, east of Ost Guruth"
    ],
    "The Scattered Tales of Audaghaim|Mirkwood": [
        "* Over the blank gravestone you will find the shade of the Record-keeper of Audaghaim, who will tell you the whole story. He is at [14.7S, 56.2W]"
    ],
    "Mother of Beasts|Forochel": [
        "* The Great Snow-matron is inside the Peikko Cave [9.5N, 79.9W]"
    ],
    "Prologue, Prologue: Make Yourself Useful|Epic - Vol. I, Prologue": [
        "* Head for Scary by going east past Overhill and Brockenborings\n* When in Scary speak with Wilcome Tunnelly"
    ],
    "Keeping the Norsu Pure|Forochel": [
        "* The Gauradan Seer is in Norsu-hauta at [8.3N, 81.5W]. He is accompanied by a wolf and is near an Elite Mammoth, but the mamoth won't attack you and will leave when the Seer is defeated."
    ],
    "Burning Nardur-stazg|Lothlórien": [
        "* The Nardur-stazg Banner is in Nardur-stazg at [8.3S, 73.5W]"
    ],
    "Tracks Through Evendim|Hunter": [
        "* The arrow head is located in the bushes beside the High King's Crossing [13.7S, 64.8W]."
    ],
    "Rending the Shadows of Sâd Meryrn|Mirkwood": [
        "* There is a Promising Bit of Earth in Sâd Meryrn at [19.0S, 57.4W]"
    ],
    "Disturbing News|Eregion": [
        "* Lengliel is at Echad Eregion [47.0S, 12.5W]"
    ],
    "Who Burgles the Burglar?|Forochel": [
        "* Kill a Gauradan Thief from anywhere"
    ],
    "Not in Hot Water|Forochel": [
        "* There are three Greater Winter-worms, one in each \"Dwarf Channel\"."
    ],
    "The Third Gear|Ered Luin": [
        "* The chest is located inside some ruins in Emyn Hoedh at [17.9S, 94.0W]. You must enter the ruins from the rear; the chest will be against the west wall near the northwest corner of the building."
    ],
    "Raw Materials|Forochel": [
        "* The moose-antlers are dropped by moose, the sinew from the Drift Wolverine, and the driftwood on the ground surrounding the lake."
    ],
    "The Ruins of Pembar|Eregion": [
        "* Pembar is at [44.1S, 10.8W]\n* Rubble are located at\n[44.2S, 11.1W]\n* [44.2S, 10.8W]\n* [44.3S, 10.7W]\n* [44.1S, 10.6W]\n* [44.0S, 10.7W]\n* [44.0S, 10.8W]\n* [44.1S, 10.9W]\n* [43.9S, 10.9W]"
    ],
    "The Lost Dwarves|Angmar": [
        "* Must have access to Eastern Malenhad via completion of Volume 1, Book 6 epic quest line.  *Note - If you don't have access to this region, you will die trying to get past the statues.\n* Entrance to the Gabilshathûr is at [2.7S, 26.4W]"
    ],
    "Hungry Mouths to Feed|Ered Luin": [
        "* The trap with the rabbit is in Haudh Lin at [21.9S, 93.9W]. You can see if there's a rabbit in a trap if you watch closely."
    ],
    "The Ties That Bind|Forochel": [
        "* Complete Instance: The Ties That Bind"
    ],
    "Book 7, Chapter 8: The Gates of Carn Dûm|Epic - Vol. I, Book 7: The Hidden Hope": [
        "* Talk to Lorniel to enter the instance\n* Protect Lorniel as you fight through several groups of Angamarin, trolls, little people, and others. AOE skills will be very helpful.\n* Fight round to the opposite side of the gate and pull the lever\n* Protect Lorniel through several more groups.\n* Defeat Mordirith, who has about 49K morale. Persistence is the key!"
    ],
    "Book 7, Chapter 2: Ringbearer's Respite|Epic - Vol. II, Book 7: Leaves of Lórien": [
        "* Frodo Baggins is at Cerin Amroth [11.8, 67.7W]\n* Samwise Gamgee is at Cerin Amroth [11.8, 67.7W], at Frodo's side as usual\n* Meriadoc Brandybuck is at Bain Gwaloth [12.9, 67.1W]\n* Meriadoc Brandybuck is in Cirin-en-Galadh [11.1, 69.1W]"
    ],
    "The Bloodstone Trove|Angmar": [
        "* The Trove is located at deep within the camp. [3.4N, 35.3 W]  It is not in a corner as the quest suggests, but out in the open in front of a tent."
    ],
    "Book 6, Chapter 3: Secrets of the Stones|Epic - Vol. I, Book 6: Fires in the North": [
        "* Find the watching stone at [3.1N, 35.7W]\n* Return to Corunir in Aughaire"
    ],
    "A Vital Message|Mirkwood": [
        "* The first Milestone is in Emyn Lûm at [14.1S, 53.0W]\n* The second Milestone is in The Dourstocks at [14.7S, 54.7W]\n* The third Milestone is in The Dourstocks at [14.6S, 55.6W]\n* As of the patch on 09/07/10 Laeginn tends to fall through the floor into the basement of The Haunted Inn, where he is inaccessible unless you have the corresponding quest that allows you to enter the basement."
    ],
    "Killing the Wolf|Mirkwood": [
        "* Âthruk can be found inside Maudhûl-ulur at [17.4S, 60.1W]"
    ],
    "Arthedain's Lost Brethren|Garth Agarwen": [
        "* Hartrím is at [28.0S, 25.2W]"
    ],
    "There's No Place Like Home|Housing": [
        "* You must have purchased a House to see the quest"
    ],
    "Uniformity|Enedwaith": [
        "* Deserter's Helm\n* Deserter's Baldric\n* Deserter's Leggings\n* Deserter's Boots"
    ],
    "City of the Golden Wood|Lothlórien": [
        "* Randiron can be found at [15.7S, 67.8W]\n* Rainen is at the first level of Telain Galadhrim [15.8S, 67.7W]"
    ],
    "Entangled Elves|Mirkwood": [
        "* There is a Cocooned Elf in the Scuttledells at [11.3S, 52.0W]\n* There is a Cocooned Elf in the Scuttledells at [10.1S, 50.3W]\n* There is a Cocooned Elf in the Scuttledells at [11.3S, 50.6W]\n* There is a Cocooned Elf in the Scuttledells at [11.5S, 51.3W]"
    ],
    "Book 9, Chapter 5: Treacherous Lights|Epic - Vol. II, Book 9: Fortress of the Nazgûl": [
        "* The real Rósar is in the Drownholt at [17.4S, 56.6W]. The other ones are actually Bog-lights luring you into a trap.\n* The real Stígur is in the Drownholt at [18.4S, 56.9W]. The other ones are actually Bog-lights luring you into a trap."
    ],
    "The Den-mother|Forochel": [
        "* The den-mother can be found in a small island in the nearby lake at [2.9N, 60.5W]"
    ],
    "Rout Gâthlata|Mirkwood": [
        "* Nulfríb and his Standard are in Gâthlata at [19.0S, 45.9W]"
    ],
    "Hiding Their Passage|Eregion": [
        "* The Hobbit Handkerchief is at [49.0S, 10.1W]\n* The Strange Branch is at [49.1S, 10.4W]\n* The Spent Arrow is at [49.1S, 10.6W]"
    ],
    "A Peculiar Tomb|Mirkwood": [
        "* The Gravestones are in the Dourstocks at [14.7S, 56.2W]"
    ],
    "Book 8, Instance: Mordirith's Fall|Epic - Vol. I, Book 8: The Scourge of the North": [
        "* This quest is meant for a fellowship. If you choose to undertake this quest solo you will receive an inspiration bonus, but the challenge will be great."
    ],
    "Angmarim Sorcery|Forochel": [
        "* The Angmarim Sorcerer is in Länsi-mâ at [8.1N, 79.3W]."
    ],
    "To Agamaur|Lone-lands": [
        "* Go to Eriac the Strong in Agamaur."
    ],
    "The Captain of Sâd Rechu|Eregion": [
        "* The Sâd Rechu Mustering-horn is in Pend Eregion [42.2S, 13.0W]"
    ],
    "Book 8, Chapter 3: Forging the Sword|Epic - Vol. I, Book 8: The Scourge of the North": [
        "* Elrond is at Rivendell in the Trollshaws.\n* Hemeldir can be found near Rivendell's forges [28.5S, 6.2W]"
    ],
    "Message to Taylor Green|Bree-land": [
        "* Taylor Green is in the Combe lumber camp, east of Combe"
    ],
    "Caradhras the Cruel|Eregion": [
        "* The Frozen Dwarf-corpse is in the Redhorn Gate at [46.5, 2.9W]"
    ],
    "An Offering of Peace, Part II|Lone-lands": [
        "* Kekkonen is at the Tornstones"
    ],
    "Orc-thieves|Lone-lands": [
        "*"
    ],
    "Strength of Stone|Angmar": [
        "* There are one or two siege engines located just outside of the Angmarim camp of Skathmúr that are relatively unguarded. They respawn every one or two minutes, so you don't need to bother taking out the ones that are heavily guarded by groups of Orcs."
    ],
    "Oppression's Yoke|Angmar": [
        "* Branan is at Donnvail [6.3N, 34.5W]"
    ],
    "Claws of the Earth|Angmar": [
        "* The Hill-claws can be found along the road just to the east of the Earth-kin camp. They seem to share spawn locations with Spiders, so you may need to defeat some of those to get the Hill-claws to spawn."
    ],
    "Stem the Invasion|Fornost": [
        "* Arch Widdup is found in the Fornost Free Peoples' Camp\n* Orcs and goblins in this area are Blogmals. Subtypes include Blogmal Guard, Blogmal Reaver, Blogmal Warlord, Blogmal Sapper, Blogmal Lieutenant, Blogmal Spear-hurler, Blogmal Spear-tosser, and Blogmal Pillager."
    ],
    "Cleansing Draught|Ered Luin": [
        "* There are some Damp Fragrant Herbs in Falathlorn around [23.0S, 92.1W]"
    ],
    "Mourning Mithrandir|Lothlórien": [
        "* The place within the canopy that matches Losdirith's description is at [14.3S, 66.8W]"
    ],
    "Scattered in the Graveyard|Forochel": [
        "* There are many Dwarf-picks leading to the Icereave Mines\n* Some locs are [8.7N, 81.4W],[8.4N, 81.2W],[9.1N, 81.3W],[9.1N, 81.6W],2 at [8.8N, 81.6W],2 at [8.7N, 81.7W],[8.9N, 81.8W],[9.0N, 81.9W]"
    ],
    "Blackwold Thieves|Bree-land": [
        "* Sergeant Applewood is located at [26.5S, 44.4W]"
    ],
    "A Defence in the Darkness|Warden": [
        "* This is a Solo quest, and cannot be completed with a Fellowship"
    ],
    "Grave-rubbings|Evendim": [
        "* The gravestones are at [9.8S, 61.5W]"
    ],
    "A Watchful Glance|Moria Central Halls": [
        "* The goblin-tribe has established at Snaga-maudhûl [7.8S, 114.4W]. You can safely get the update from the path winding down at [8.0S, 114.5W]"
    ],
    "At Home Among the Trees|Lothlórien": [
        "* You have 1 min 30 s to find the flet-runner"
    ],
    "Dark and Shallow Water|Moria Lower Deeps": [
        "* The first goblin-corpse is at [17.0S, 116.2W]\n* The second goblin-corpse is at [17.0S, 116.6W]\n* The third goblin-corpse is at [16.7S, 116.5W]\n* The fourth goblin-corpse is at [16.9S, 116.9W]"
    ],
    "A Threat to Pembar|Eregion": [
        "* Pembar is at [44.1S, 10.8W]"
    ],
    "Echoes of Battle|Minstrel": [
        "* Snapjaw is in the Redhorn Lodes at [10.9S, 104.3W]"
    ],
    "The Forgotten Company|Fornost": [
        "* Bartelot Took is found in the Fornost Free Peoples' Camp\n* The skeletons for these arrowheads are found in the entry areas of the instance:\nin the entry area as you come through the gate into Fornost\n* up the stairs in and around Sara Oakheart's \"pens\"\n* in the swamp\n* to the right of the swamp near the Jarg-Olog trolls.\n* Skeletons drop one arrowhead each, and they are usable only by one person. Be advised, it may take your group two trips into Fornost to get all the arrowheads you need.\n* Tip: Kill every mob in an area before looting the skeletons. This will prevent you from accidentally drawing aggro while trying to loot a skeleton."
    ],
    "Instructions in the Map|Moria Upper Levels": [
        "* Páshnar is in Nud-melek, at [7.1S, 103.2W]"
    ],
    "The Prisoner of Barad Morlas|Eregion": [
        "* You must escort Anurandir till [47.3S, 13.5W]"
    ],
    "Halls of Crafting: Banishing War|Dungeons of Lothlórien": [
        "* You can place the Elf-stone in a Stone Platform in Thaguzg's room when he is defeated."
    ],
    "Moving Them Off|Frostbluff": [
        "* The beggars are scattered around town.  If the beggars are not there, wait for them to respawn."
    ],
    "Breakfast in the Ruins|Evendim": [
        "* Alfred Whitley's camp is at [14.9S, 65.9W]."
    ],
    "Fail-á-Khro Retaken|Angmar": [
        "* Cána is at Fail-á-Khro."
    ],
    "Meaning upon Meaning|Rune-keeper": [
        "* Travel from the rune-keeper trainer to Gondamon in Ered Luin and speak with Dardúr."
    ],
    "A Foul Wood|Eregion": [
        "* Twisted Hollies, Grasping Holly-tenders, and Fell Holly-tenders are in Glâd Ereg."
    ],
    "Smouldering Remains|Eregion": [
        "* Burnt Tor is near Ruidhriel, at [49.1S, 10.5W]"
    ],
    "An Audition|Forochel": [
        "* The Caged Red-fang is a signature mob, so if you are at a lower level when fighting it, you may need to bring along some morale potions. It has standard warg abilities."
    ],
    "Hunters in the Blinding White|Forochel": [
        "* The best place to hunt those Gauredain is Barad Gaurhoth, where you can find all three types of Gauredain."
    ],
    "An Inspiration to Men|Captain": [
        "* Aldis Oatbearer is found inside Brigand's Watch in Bree-land. [27.2S, 56.2W]."
    ],
    "The Fountain of the Lady|Lothlórien": [
        "* The first pitcher must be carried to the Parched Elf at [14.5S, 66.3W]\n* The second pitcher must be carried to the Parched Elf at [14.5S, 67.0W]\n* The second pitcher must be carried to the Parched Elf at [15.3S, 67.1W], at the end of the carpeted path just before the stairs that lead to the House of Celeborn"
    ],
    "Book 1, Expedition: The Common Thread|Epic - Vol. II, Book 1: The Walls of Moria": [
        "* Filgogân is at [53.1S, 7.5W]\n* Defeat half-orcs inside who will drop the painted stones"
    ],
    "Hewing the Wood|Evendim": [
        "* 21"
    ],
    "A Moment for Amroth|Lothlórien": [
        "* One of the docks is at [17.5S, 64.5W]"
    ],
    "Disease Among the Boars|Bree-land": [
        "* Defeat Diseased Bristlehides\n* Return to Constable Thistlewool"
    ],
    "Clear Water|Lone-lands": [
        "* pending"
    ],
    "The Path to Learning, Part I|Crafting": [
        "* Seek out Nathronwen in Duillond and speak to her."
    ],
    "Feathered Foes|North Downs": [
        "* Talk to Orthonn at [9.4S, 47.3W]\n* Return to Hannar"
    ],
    "Amber for Othrikar|Crafting": [
        "* Jaki Stonehand [5.4S, 46.9W] can be found NW of Othrikar near the Fatherlode."
    ],
    "Book 2, Chapter 14: History of the Red Maid|Epic - Vol. I, Book 2: The Red Maid": [
        "* Talk to Radagast the Brown in his tower in the back of Ost Guruth"
    ],
    "Cutting Cords|Ered Luin": [
        "* Vifill is in the Vale of Thráin at [19.0S, 101.7W]"
    ],
    "Ancient Records|Mirkwood": [
        "* There are many Silvan records on the remaining walls of the Wild Ruin"
    ],
    "Singing to Saplings|Lothlórien": [
        "* Orthir can be found in Cirin-en-galadh at [11.8S, 68.8W]\n* Saplings can be found at:"
    ],
    "War-masters in Moria|Moria Central Halls": [
        "* Narfi is at The Twenty-first Hall"
    ],
    "Crannog's Second Challenge|Angmar": [
        "* Lakhina is at [0.0N, 39.6W]\n* Camran is at [0.1N, 39.6W]\n* Rona is at [0.1N, 39.6W]"
    ],
    "An Outstretched Hand|Enedwaith": [
        "* A Healing Hand\n* Feathers for Friendship\n* Warmth for the Winter"
    ],
    "Dourhand Plans|North Downs": [
        "* The Dourhand plans are in a chest at [7.2S, 47.3W]"
    ],
    "Noisome Neighbours|Lone-lands": [
        "* The nerbyg are in the Bloodmire, east of Ost Guruth"
    ],
    "Records of the Dark Times|Moria Upper Levels": [
        "* Bói is the Bard of the Twenty-first Hall, and can be found in The Twenty-first Hall at [5.9S, 105.1W]"
    ],
    "Protecting the Herd|Enedwaith": [
        "* Kill peikkos around Sûri-kylä"
    ],
    "Book 9, Chapter 3: Journey to Gondamon|Epic - Vol. I, Book 9: The Shores of Evendim": [
        "* The Knight of Mordirith in Ered Luin is Kevoca (lvl 50 Signature with 4,428 morale) and can be found near Ringdale [18.4S, 96.1W]"
    ],
    "Book 2, Chapter 2: Store-houses of the Western Halls|Epic - Vol. II, Book 2: Echoes in the Dark": [
        "* You will find a broken tablet within an old strongbox in the Chamber of Wisdom [7.9S, 112.3W]\n* You will find some dusty pages within an old strongbox in the Chamber of Knowledge [7.5S, 112.0W]\n* You will find a weathered tome within an old strongbox in the Chamber of Deep Thought [8.3S, 114.9W]"
    ],
    "Crannog's Fifth Challenge|Angmar": [
        "* Nekhtan is found by a tree in Fasach-larran [1.7N, 37.7W]"
    ],
    "Against the Cold|Forochel": [
        "* The bears (Ice-shore Matron, Ice-shore Yearling, Ice-shore Bear) are east of Sûri-kylä"
    ],
    "Book 13, Chapter 3: Favour of Wisdom|Epic - Vol. I, Book 13: Doom of the Last-king": [
        "* Clothing (Fur Pelts)\n* Water (Bucket of Water)\n* Fire (Campfire)\n* Food (Fish)\n* Weapons (Weapon Rack)"
    ],
    "Wolf-bounty|Eregion": [
        "* Wolves can be found throughout Eregion."
    ],
    "Escape from Duskencleft|Evendim": [
        "* The Relic of Satchels is by the pass to The Duskencleft [5.1S, 66.7W]"
    ],
    "Falling Standards|Forochel": [
        "* Reginald's Banner can be found in Jä-rannit at [15.2N, 66.6W]"
    ],
    "Book 1, Chapter 11: Worth Beyond Measure|Epic - Vol. II, Book 1: The Walls of Moria": [
        "* Dithalion [28.5S, 6.2W] is by The Forges of Rivendell and Wafi [28.5S, 6.2W] is by The Forging Hall in Thorin's Hall\n* There is a dwarf Forge-master right at his side."
    ],
    "Book 7, Chapter 2: Crossing the Shadow|Epic - Vol. I, Book 7: The Hidden Hope": [
        "* Head West from Gath Forthnír to find Raghnall\n* When you've spoke to him, 1 Hunting Morroval will show up but it will disappear after a minute so you don't have to kill them\n* Return to Lorniel"
    ],
    "Lest We Forget|Moria Upper Levels": [
        "* Stand before the northern statue at [3.0S, 109.0W]\n* Stand before the southern fountain at [4.2S, 109.1W]\n* Stand before the central statue at [3.6S, 109.3W]"
    ],
    "A Bird in the Hand|North Downs": [
        "* The northhawks are south and around Othrikar."
    ],
    "Rhudaur's Traitors|Lone-lands": [
        "* The satchels can drop from the Rhudaur north-east of the Eglan-camp."
    ],
    "Prologue, Prologue: Mundo's Complaint|Epic - Vol. I, Prologue": [
        "* Head for Michel Delving to the south and speak with Mayor Will Whitfoot"
    ],
    "The Dark Apprentice|Mirkwood": [
        "* The Corrupted Altar is in Sâd Morangol at [18.6S, 48.7W]\n* Destroying the Altar will summon Mâb Rhûnadan"
    ],
    "The Light of Hope|Angmar": [
        "* Garvan is at Donnvail [N, W]"
    ],
    "Purging the Dead|Great Barrows": [
        "* Kill wights inside the Great Barrow instances: Thadúr, Maze, and Sambrog"
    ],
    "Cat-tusk Scrimshaw|Forochel": [
        "* Kill Kalpa-kitas around the camp and the enclave south of the camp"
    ],
    "Sealing the Gate|Moria Central Halls": [
        "* The goblins are in Snaga-maudhûl [7.8S, 114.4W]."
    ],
    "Rumming's Remaining Riddle|Evendim": [
        "* The answer to the riddle is \"Worm\". The Chest of the Worm can be found at [12.0S, 71.0W]"
    ],
    "Book 2, Chapter 1: New Residents|Epic - Vol. II, Book 2: Echoes in the Dark": [
        "* Bósi is at the Chamber of the Crossroads [5.2S, 112.1W]"
    ],
    "Stolen Skulls|Angmar": [
        "* The skull is in the Orc camp to the south east of Ram Dúath."
    ],
    "A Sword Shivered|Forochel": [
        "* Kill Gauradan Ravagers and Gauradan Stalkers at [13.8N, 76.9W]"
    ],
    "Moving Unseen|Eregion": [
        "* Lynx can be found prowling in High Hollin, north-east of Echad Eregion. A high concentration of Lynx can be found at Talath Dindal."
    ],
    "Now is Found|Ered Luin": [
        "* Langlas in Thrasi's Lodge at [21.6S, 94.1W]"
    ],
    "Hallowed Ground|Ered Luin": [
        "* The Stone Table in Tham Gelair is at [27.5S, 94.4W]"
    ],
    "The Lost Explorers|Mirkwood": [
        "* There is an Elf-sword outside the southern entrance to Dannenglor, in the Dourstocks, at [12.4S, 55.1W]"
    ],
    "Vengeance in the Ruins|Evendim": [
        "* Brychan the Bald can be found in some ruins slightly south of Ost Forod [8.2S, 63.7W]"
    ],
    "The Bounty-hunter|Evendim": [
        "* The poster Basil Gummidge asks you to read is very close to him [7.4S, 64.4W]"
    ],
    "Battle of the Snowballs (Easy)|Frostbluff": [
        "* Hit players with the snowballs while in the Snowball Field.  Players that can be hit do not have to be participating.\n* It's not necessary to barter snowballs first, it's also possible to make them at The Snowball Field."
    ],
    "The Path From Rivendell|Eregion": [
        "* Worms can be found in the valleys east of Gwingris."
    ],
    "The Rite of Clúcath|Angmar": [
        "* Osbail is at Aughaire [0.0S, 40.2W]\n* Camran is at Aughaire [0.1N, 39.6W]\n* Tasgall is at Fasach-larran [2.5N, 38.4W]"
    ],
    "Mistress of Shadows|Angmar": [
        "* The cave Rimpúrod that contains Morcheryn is found down the narrow passage through some cliffs a little north and west of the Earth-kin Scout. She is at the far back of the cave, on the right side. It is recommended to bring 3-5 players to defeat her, since she is an Elite and has a few adds."
    ],
    "Pillars of Another Age|Mirkwood": [
        "* The northern Ancient Pillar is in the Ashenslades at [18.2S, 44.5W]\n* The central Ancient Pillar is in the Ashenslades at [18.5S, 44.8W]\n* The southern Ancient Pillar is near the Bleakmere at [18.8S, 44.3W]"
    ],
    "Man-slayers|Lone-lands": [
        "* The Orcs to kill are in Ost Cyrn [33.6S, 30.9W]"
    ],
    "A Brokered Peace|Lone-lands": [
        "* Return to Ost Guruth and talk to Frideric the Elder"
    ],
    "The Thieving of the Shrew|Lothlórien": [
        "* As you follow the track of the shrew, you will come across some Elves that will point you in the correct direction, as shown above.\n* Cordofron is the first NPC that will offer a hint on the shrew's path, and can be found at [14.6S, 66.8W]\n* Luinhen is the next NPC that will offer a hint on the shrew's path, and can be found at [15.5S, 66.4W]\n* Aecthor is the last NPC that will offer a hint on the shrew's path, and can be found at [15.9S, 66.9W]\n* The Pipe-weed Pouch is in a rock in the middle of a nearby pool [15.7S, 67.0W]"
    ],
    "The Finest Shield in the Land|Forochel": [
        "* Nef's is a Broken Shield that can be found in Jä-rannit at [16.0N, 63.7W]"
    ],
    "Beacon in the Snow|Forochel": [
        "* The Kantâ-vilkku (or Snow Beacon) is in Jä-rannit at [18.2N, 66.7W]. You can find the pieces you need between the beacon and the road."
    ],
    "Ceremonial Dagger -- Introduction|Reputation": [
        "* Craft 5 daggers and return to Cannasgam at Tinnudir in Evendim"
    ],
    "Over the Pass of Caradhras|Eregion": [
        "* Type /look at [46.4S, 4.7]"
    ],
    "The Ransom of Angmar|Forochel": [
        "* Drops off of Angmarim soldiers."
    ],
    "Unsure Steps|Eregion": [
        "* Ruidhriel is encamped near the Burnt Tor, north-west of Echad Dúnann.\n* Limlaer is encamped along the road, south-west of Echad Dúnann."
    ],
    "Elessar's Return|Lothlórien": [
        "* Milwen can be found in Cirin-en-Galadh [11.9S, 69.0W]\n* As stated, Aragorn is in the Company's Pavilion [15.0S, 66.8W]"
    ],
    "The Hirvi-herd|Forochel": [
        "* Matti is in Sûri-kylä at [19.5N, 71.3W]\n* Kaleva is in Sûri-kylä at [19.2N, 70.9W]\n* Rauno is inside the Great Lodge of Sûri-kylä at [19.5N, 72.0W]"
    ],
    "Common Blood|North Downs": [
        "* Ragnarr and the camp are at [9.3S, 39.9W]"
    ],
    "Bear-hunter|North Downs": [
        "* The bears are scattered south of Othrikar."
    ],
    "Challenge: Ivar|Garth Agarwen": [
        "* Ivar's wight-banners do not move and have low Morale. These banners provide with buffs and makes the encounter more challenging. Move Ivar to a place away from the banners. Throughout the battle, additional wights will spawn from the two mounds on his left and right.\n* Tank - make sure to grab the adds and kill them before going back on Ivar.\n* DPS - make sure to kill the adds before going back to Ivar.\n* Failure on killing the adds will mean more adds will spawn in addition to the ones that aren't killed and will result in a wipe."
    ],
    "Tidying Up|Frostbluff": [
        "* There are four areas to clean up in the north, east, south, and west side of Winter-home."
    ],
    "Hana's Dream|Lone-lands": [
        "* Hana the Young is in the back of Ost Guruth"
    ],
    "Grudgingly-earned|Forochel": [
        "* Kaj is at [11.4N, 69.4W]\n* Niko is at [7.5N, 75.5W]\n* Lauri is at [11.3N, 69.5W]"
    ],
    "Fixing Falco's Folly|Bree-land": [
        "* Jasper Mudbottom is found inside Ost Baranor south of Staddle. [33.7S, 48.6W]"
    ],
    "Purification of Death|Angmar": [
        "* pending"
    ],
    "The Bracelet's Past|North Downs": [
        "* The graves are located in the Fields of Fornost [11.1S, 57.1W]"
    ],
    "A Flower for Nimrodel|Lothlórien": [
        "* You must leave the flower in a Silver Plate beneath the statue of Nimrodel [15.1S, 67.9W]"
    ],
    "Chasing Trouble|Eregion": [
        "* You will only have 30 min to find the Half-orc Rider\n* The Half-orc Rider is in the Nan Sirannon area [52.1S, 9.6W]"
    ],
    "Vow of Vengeance|Ered Luin": [
        "* Glamír is on some Elf-ruins in Haudh Lin at [18.9S, 95.2W]"
    ],
    "The Accursed City|Mirkwood": [
        "* The Condemned Villager will attack you when we ends his speech. He is in Audaghaim at [13.8S, 54.9W]"
    ],
    "Puzzle of the Carvings|Moria Upper Levels": [
        "* The Carved Stones are in The Great Hall of Durin at [7.8S, 105.6W]\n* The answers to the riddles are, in order: Tree, Coffin, Broom, Skull, Onion"
    ],
    "Ancient Rituals|Forochel": [
        "* You can use the feathers in your inventory anywhere in Reodh Fuil\n* You must place the fish upon a Ritual Stone in Jä-rannit at [15.3N, 66.7W]"
    ],
    "Book 7, Chapter 7: The Key Forged|Epic - Vol. I, Book 7: The Hidden Hope": [
        "* Return to Lorniel in Gath Forthnír."
    ],
    "The Writhing Glade|Mirkwood": [
        "* You will need to defeat 5 Mirk-huorns. Those are Signature creatures, but you might find yourself fighting more than one at the same time. Hence the Small Fellowship type of the quest.\n* After defeating the 5 Mirk-huorns, speak with the Wrathful Huorn in Sâd Meryrn at [19.0S, 57.3W]"
    ],
    "Drawing the Enemy|Eregion": [
        "* You can set the false firecamp on a Clear Patch in Emyn Naer, at [54.2S, 11.2W]"
    ],
    "A Tour of Bree|Bree-land": [
        "* Talk to Bonny Thatcher at the Three-farrow Crafting-hall\n* Talk to Second-watcher Heathstraw near the Boar Fountain\n* Talk to Barliman Butterbur at The Prancing Pony Inn\n* Talk to Lily Sandheaver at her home near the West-gate\n* Talk to Harry Goatleaf at the West-gate\n* Talk to Watchman Cardoon near the West-gate\n* Talk to Ted Gardener/Maud Foxglove at the vault\n* Talk to Clar Whitethorn at Whitethorn's Taxidermy right across the vault\n* Talk to Newbold Leafcutter inside the Scholar's Stair\n* Talk to Mat Heathertoes in Beggar's Alley\n* Talk to Lily Appledore at the Bree Jail\n* Talk to an auctioneer near the South-gate\n* Talk to Tad Leafcutter at the hunting-lodge in south Bree\n* Return to Mayor Graeme Tenderlarch at the Bree Town Hall"
    ],
    "The Terror that was Azog|Moria Upper Levels": [
        "* Arnfinn is in a corner in The Mustering Hall at [2.9S, 106.9W]"
    ],
    "Niphredil and Elanor|Lothlórien": [
        "* Maliriel is at [17.2S, 64.0W]\n* Ambendel is at [14.3S, 73.1W]\n* Bahanneth is at [12.1S, 71.1W]"
    ],
    "The Biggest Stomach of Them All|Festival": [
        "* This quest is actually in 5 quests, but as soon as you fail one, the whole chain fails.\n* Each part has it's own reward:\n* 90\n* 90   and  Frostbluff Coins (2x)\n* 90   and  Frostbluff Coins (3x)\n* 90   and  Frostbluff Coins (4x)\n* 90   and  Frostbluff Coins (4x)\n* You should avoid eating Bread or Pie, this takes a lot of time to consume and slows you down even more.\n* Drinking the awkward drink from the mug has a chance to removes all stuffed effects, but if you are unlucky it may give you the debuff Horribly Ill and all stuffed effects remain."
    ],
    "Howling on the Hill|Mirkwood": [
        "* The Wolf-whistle is on the Pack-howler's Hill at [15.4S, 56.0W]"
    ],
    "A Strange Message|Eregion": [
        "* Known drops: Angmarim Scout (Eregion)"
    ],
    "Fisherman's Friend|Forochel": [
        "* Kill any Angmarim along the shore of the Ice Bay"
    ],
    "Instance: A Lore-master's Will|Lore-master": [
        "* This is a Solo quest, and cannot be completed with a Fellowship.\n* The Private Instance does not require any fighting. Sit back and enjoy the story."
    ],
    "A New Gear|Moria Lower Deeps": [
        "* Jatgír is in The Rotting Cellar at [14.6S, 111.9W]"
    ],
    "Instance: The Assault on Archet|Introduction": [
        "* Clear out the invading Blackwolds\n* Talk to Jon Brackenbrook after clearing each area\n* Jon Brackenbrook must not die"
    ],
    "A Wandering Pony|Eregion": [
        "* Bill the Pony can be found in Torech Andraug at [50.9S, 9.6W]. Just finding him will complete the quest."
    ],
    "Quenching a Thirst|Ered Luin": [
        "* There are thickets clogging the canal in the Vale of Thráin at [20.0S, 100.6W]"
    ],
    "There and Back Again|Evendim": [
        "* This last Stone Marker is the first one you found, the one in Canadiach [10.7S, 64.8W]"
    ],
    "The Cat's Meow|Ered Luin": [
        "* The Abandoned Den can be found in Haudh Lin at [20.8S, 94.3W]"
    ],
    "Gredbyg in the Camp|Moria Upper Levels": [
        "* Balin's Camp is at [5.8S, 103.9W], and can only be reached by the way that crosses the Deep Crossroad"
    ],
    "Builder Earur|Bree-land": [
        "* Earur's toolbox is at [27.7S, 49.0W] guarded by a fierce boar."
    ],
    "A Minuscule Menace|Forochel": [
        "* The snarling wolverine can be found in Taur Orthon at [3.2N, 59.7W]"
    ],
    "Ice at the Water's Edge|Forochel": [
        "* You have 45 min to place the Ice Statuette on the Shrine Pedestal in Vesi-paistâ at [14.5N, 76.1W]"
    ],
    "Bolster the Defences|North Downs": [
        "* Collect the barrel of nails [16.0S, 52.8W]\n* Collect the crate of hammers [15.3S, 52.2W]\n* Collect the crate of saws [14.9S, 52.1W]"
    ],
    "Following the Path|Eregion": [
        "* The campsite is in Tâl Caradhras [45.9S, 8.7W]"
    ],
    "Wetlands of Southern Mirkwood|Mirkwood": [
        "* You can collect water-samples at many locations in the Drownholt: [17.5S, 55.9W], [18.0S, 55.7W], [18.0S, 56.0W], [18.1S, 56.1W], [18.4S, 56.5W], [18.3S, 57.1W], [18.5S, 55.2W], [18.7S, 55.2W], [18.3S, 54.9W], [18.2S, 55.1W]"
    ],
    "A Dangerous Lair|Mirkwood": [
        "* To summon the Dourstocks Lair-spinner use the Enormous Cocoon in The Dreadweaver's Lair at [14.7S, 57.8W]"
    ],
    "Undisturbed Rest|Forochel": [
        "* Defeat Tundra Bears around Zigilgund"
    ],
    "Lord and Lady of the Golden Wood|Lothlórien": [
        "* Both Lord Celeborn and Lady Galadriel are in the House of Celeborn [15.4S, 66.9W], that can be reached following the teal carpet behind Forbad"
    ],
    "Prologue, Prologue: The Aid of Halros|Epic - Vol. I, Prologue": [
        "* Halros can be found at [26.7S, 67.0W]"
    ],
    "Instance: A Cornered Foe|Mirkwood": [
        "* WARNING: This is a solo quest, and cannot be completed in a fellowship."
    ],
    "Someone Worthy|Ered Luin": [
        "* Penglir is at Duillond in Ered Luin [23.9S, 92.6W]"
    ],
    "Book 8, Chapter 4: A Beacon of Hope|Epic - Vol. I, Book 8: The Scourge of the North": [
        "* Laerdann and Golodir are in Gath Forthnír in Angmar"
    ],
    "Establishing a Foothold|Mirkwood": [
        "* You must plant the banner in a Rock-pile in Fállug at [16.7S, 62.0W]"
    ],
    "Stealing Stores|Angmar": [
        "* The food-store boxes are in Donnvail."
    ],
    "Miraculous Growth|Enedwaith": [
        "* [63.7S, 23.2]\n* [64.0S, 23.1]\n* [64.1S, 22.9]\n* [63.8S, 22.5]\n* [63.6S, 22.8]\n* [63.4S, 22.6]\n* [63.6S, 22.5]\n* [63.7S, 22.6]\n* [63.9S, 21.5]\n* [64.3S, 21.4]"
    ],
    "Routing Cry|Captain": [
        "* Nanulg is in Hurmulkezer at [17.0S, 107.2W]"
    ],
    "Wargs of Shadow|Eregion": [
        "* Burnt Tor is near Ruidhriel, at [49.1S, 10.5W]"
    ],
    "Pembar's Unwelcome Visitors|Eregion": [
        "* Pembar is at [44.1S, 10.8W]"
    ],
    "Beyond the Gloaming Falls|Evendim": [
        "* This Stone Marker is near the highest Gauradan camp. You can only get there following a narrow path that goes uphill and past many gauradans camps. They are all soloable, but it can be slow without some friends. [4.9S, 73.8W]"
    ],
    "Exiles of Winter|Forochel": [
        "* Nicca is north-east of Zigilgund"
    ],
    "Book 3, Chapter 4, Part II: Freeing Dori|Epic - Vol. I, Book 3: The Council of the North": [
        "* Dori is imprisoned at [7.7S, 47.0W]"
    ],
    "A Respectable Ritual|Forochel": [
        "* You can get a Coil of Rope at [10.0N, 69.6W]\n* Altti is in Jänis-leiri at [7.4N, 75.4W]"
    ],
    "Crafting: Supplies for the Lumber-camp|Crafting": [
        "* Collect rowan hammer\n* Collect rowan haft (0/3)"
    ],
    "Târ Stazg's Chief|Eregion": [
        "* The Târ Stazg Mustering Horn is in Târ Stazg, at [48.4S, 5.5W]"
    ],
    "The Secret of the Council|Moria Lower Deeps": [
        "* The secret chamber is in the Second Hall, in Nud-melek, at [8.9S, 103.2W]"
    ],
    "Poaching: Protected Deer in Lórien|Lothlórien": [
        "* After accepting this quest, but before turning it in, you will be offered the An End to the Poaching quest. If you complete Asmund's quest, you will fail Limhendeth's one. If you turn in Limhendeth's quest, you will fail the poaching quest and won't be able to take any more poaching quests, should there be more."
    ],
    "Thurmaer's Lucky Arrow|Forochel": [
        "* Beleganc can be found in Talvi-mûri around [16.0N, 84.0W]"
    ],
    "Reclaiming the Homestead|Forochel": [
        "* Fëoc can be found at Voi-teltta at [10.2N, 71.8W]"
    ],
    "Hunting Wargs|North Downs": [
        "* Kill any of the Dire Wargs and Warg Hunters will count in the eastern Nan Amlug"
    ],
    "Building the Snow-sled|Forochel": [
        "* Ofráth is in Taur Orthon near the mammoths at the entrance to Kauppa-kohta at [2.4N, 58.3W]\n* The Curing Barrel is in Kauppa-kohta at Eija's side [3.0N, 58.3W]"
    ],
    "A Remarkable Bow|Ered Luin": [
        "* Starkath can be found right outside the wall of Kheledul, at [21.1S, 92.4W]"
    ],
    "Book 3, Chapter 5, Part II: Tending the Glade|Epic - Vol. I, Book 3: The Council of the North": [
        "* You can wait for Drukordh to walk away from the other mobs before engaging in battle so that no adds participate"
    ],
    "Lembas for the Gates|Lothlórien": [
        "* Losdirith can be found at [15.5S, 66.1W]\n* Minathlang can be found at [16.2S, 67.0W]"
    ],
    "Resupplying the Beacon|Forochel": [
        "* The Kantâ-vilkku (or Snow Beacon) is in Jä-rannit at [18.2N, 66.7W]. The crate you must resupply are at the beacon. To find sign of what destroyed the beacon, inspect some Snow Beacon Supplies near the beacon at [18.5N, 66.3W]"
    ],
    "The Butchered Herd|Enedwaith": [
        "* [64.9S, 15.8W]\n* [64.9S, 16.0W]\n* [64.9S, 16.2W]"
    ],
    "The Will of the Iron, Part II|Crafting": [
        "* The Ancient Emblem drops from the Shades in the Fields of Fornost in North Downs"
    ],
    "Book 6, Chapter 5: The Sorcerer's Doom|Epic - Vol. I, Book 6: Fires in the North": [
        "* Enter Tór Gailvin and defeat Sorcerer Tath. The spirit will aggro after Tath is dead but does not need to be defeated.\n* Loot Tath's body and return to Corunir in Aughaire."
    ],
    "Scattered Belongings|North Downs": [
        "* [14.2S, 44.1W]\n* [14.5S, 44.1W]\n* [14.8S, 43.7W]\n* [14.3S, 43.1W]\n* [14.0S, 43.1W]\n* [14.7S, 43.2W]\n* [14.6S, 42.5W]\n* [14.5S, 42.3W]\n* [14.8S, 42.1W]\n* [14.2S, 42.6W]"
    ],
    "Searching for Eagles|Lothlórien": [
        "* Talan Brethil is at [12.2S, 62.4W]\n* Talan Gwilith is at [11.4S, 70.7W]\n* Talan Fanuidhol is at [12.1S, 71.1W]"
    ],
    "Wards of the Gauredain|Evendim": [
        "* 1st ward is located at [4.1S, 73.0W] just inside the pass leading into their camp.\n* 2nd ward is located at [3.8S, 72.7W] along the riverbed.\n* 3rd ward is located at [4.4S, 72.2W] up the hill on the path #2 was found at.\n* 4th ward is located at [4.1S, 72.0W] in the encampment up hill from #4.\n* 5th ward is located at [3.7S, 72.4W] down the hill (next path over) from #4."
    ],
    "Fisherman's Foe|Forochel": [
        "* The buckets are at the edge of the east side of the lake south of Sûri-kylä"
    ],
    "Spider-bane|Bree-land": [
        "* Iornaith is on the west side of the cave. Make sure to kill the two mobs not connected to Iornaith, just in case."
    ],
    "The Emissary|Misty Mountains": [
        "* Go north to Gondamon\n* Speak with Gailthin"
    ],
    "A Defence of Marigolds|Enedwaith": [
        "* [64.5S, 21.3W]\n* [64.2S, 21.3W]\n* [63.9S, 21.5W]\n* [63.5S, 22.0W]\n* [63.7S, 21.9W]\n* [63.1S, 22.7W]\n* [63.3S, 22.7W]\n* [63.4S, 22.6W]\n* [63.6S, 22.7W]\n* [63.6S, 22.8W]"
    ],
    "Into Bree|Bree-land": [
        "* Second-watcher Heathstraw is near the Boar Fountain"
    ],
    "A Lesson from Lindir|Minstrel": [
        "* Lindir is in the Hall of Fire in The Last Homely House in Rivendell"
    ],
    "Winter Gloves|North Downs": [
        "* Collect the lynx-furs from the lynx south and around Othrikar"
    ],
    "Fell the Trolls|Fornost": [
        "* Silith, is located in the Fornost Free Peoples' Camp\n* Jarn-olog Warriors are melee; the trolls named simply Jarn-olog are ranged and will throw stones.\n* The trolls often live or patrol in groups of two. They have a knockback skill which sends the player flying through the air."
    ],
    "Crannog's Challenge|Angmar": [
        "* Torquil is at [0.0S}40.2W, 0W]\n* Raith is at [0.1S, 40.1W]\n* Osbail is at [0.0S, 40.2W]"
    ],
    "The Tainted Living|Lone-lands": [
        "* The stumps are scattered north-west of the Eglain-encampment."
    ],
    "Wings of Darkness and Death|Angmar": [
        "* The Merrevail can be found just to the north of the Scout. Although the quest is marked as Small Fellowship, the mobs are Signature difficulty and can be taken down one at a time solo. Consider getting a small fellowship together though, since the follow-up quest Mistress of Shadows requires it."
    ],
    "False Orders|Angmar": [
        "* Sub-commander's strongboxes are found in Dûn Covád at:\n[5.3N, 38.4W]\n* [5.9N, 38.3W]\n* [5.7N, 38.5W]\n* [5.6N, 38.7W]"
    ],
    "Wild Ruins|Mirkwood": [
        "* There is nothing to be found in the south-east ([15.4S, 50.4W]) and southern ruins ([15.4S, 51.1W]), but there are some Odd Footprints in the Wild Ruin at [15.2S, 52.0W]"
    ],
    "Wilderness by Ost Guruth|Hunter": [
        "* After speaking with Unni, if you follow your directions you will find some Subtle Tracks that will give you new directions. If you keep following the directions correctly, you will find more Subtle Tracks that will led you closer to Hogahild. If you stray from the correct direction, you will find some Subtle Tracks that won't give any clear directions. Of course, you can go straight to Hogahild. She is located directly due east of Ost Guruth, due north of the \"G\" and \"M\" of the name \"Haragmar\" on the map. Just take the east exit from Ost Guruth and follow the hillside around the Red Swamp [30.5S, 27.6W]"
    ],
    "Dead Water|Lone-lands": [
        "* pending"
    ],
    "The Sundered Shield|Ered Luin": [
        "* You can find a Sundered Shield on some newly placed grave-markers in Ringdale at [18.0S, 96.0W]"
    ],
    "Bounty: Harry Hinchcliffe, Dead-eye|Evendim": [
        "* Ballard Wilmer is in Ost Forod [8.0S, 64.2W]"
    ],
    "What was Lost|Ered Luin": [
        "* The broken sword is in a Stone Cairn in Dol Ringwest at [24.9S, 95.1W]"
    ],
    "What Else Left Behind?|Eregion": [
        "* Rinneldor is at Echad Dúnann"
    ],
    "Book 2, Instance: Red-pass|Epic - Vol. I, Book 2: The Red Maid": [
        "* Kill all the mobs in the way. Radagast will not aggro or hit the mobs."
    ],
    "What Came to Pass|Mirkwood": [
        "* You will find the records buried under som Loose Earth in Audaghaim at [14.0S, 55.2W]"
    ],
    "Well-prepared|Lone-lands": [
        "* Northrim is at Dol Vaeg\n* The boars are east of Dol Vaeg"
    ],
    "Weavers Beneath the Ruins|Lone-lands": [
        "* The spiders for this quest are in the valley beneath the ruins southeast of the Forsaken Inn [36.2S, 39.1W]."
    ],
    "Waste Near Gath Forthnir|Hunter": [
        "* 1) [10.0N, 25.0W]\n* 2) [9.2N, 24.5W]\n* 3)[10.0N, 26.1W]"
    ],
    "Fruits of the Forest|Evendim": [
        "* [7.7S, 72.1W]\n* [8.1S, 72.2W]\n* [8.2S, 72.3W]\n* [7.8S, 73.1W]\n* [7.3S, 72.3W]\n* [7.8S, 72.7W]"
    ],
    "Prologue, Prologue: Troubles To Come|Epic - Vol. I, Prologue": [
        "* The Brockenborings Watch Office, inside of which is Bounder Primstone, can be found at 27.5S, 68.1W.\n* Wilcome Tunnelly can be found at 27.9S, 66.3W."
    ],
    "Prologue, Prologue: Goblin Foothold|Epic - Vol. I, Prologue": [
        "* The goblins can be found at Scrag-dells, the entrance to which is at 25.0S, 67.0W."
    ],
    "Keepers of the Wood|Eregion": [
        "* Holly-troll Warriors, Holly-troll Lobbers, and Holly-troll Elders are in Sâd Thareg"
    ],
    "Book 7, Instance: The Gates of Carn Dûm|Epic - Vol. I, Book 7: The Hidden Hope": [
        "* Follow Lorniel\n* Push the lever using the path on the right side\n* Follow Lorniel until the East Gate of Carn Dûm\n* Defeat Mordirith\n* Talk to Golodir"
    ],
    "Prologue, Instance: To Avert a War|Epic - Vol. I, Prologue": [
        "* Follow and defend Langlas\n* Everytime he takes a pause, speak with him\n* Defeat Hakon Ironfist\n* Talk to Langlas to leave the instance"
    ],
    "Purging Evil|Mirkwood": [
        "* The Idol of the Necromancer is in Burgûl-stazg at [12.6S, 59.0W], and is guarded by Grishbugud."
    ],
    "The Carver's Stash|Moria Upper Levels": [
        "* You will find several hide-bound books in some Rubble in Nud-melek at [8.5S, 103.9W], but before you can search the rubble you will have to defeat the signature orc and the troll that are nearby."
    ],
    "The Thief-takers|Evendim": [
        "* Crates can be found at [7.4S, 69.4W]\n* This quest is incorrectly marked as fellowship. The crates are guarded by 36 and 37 non-elite mobs. This is a solo-able quest.\n* Do this alongside Quest:Practised Villainy, the objectives are the same."
    ],
    "A Cry of Vengeance|Captain": [
        "* Pukhal is in the Flaming Deeps at [14.1S, 109.9W]"
    ],
    "Reconnecting Ties|Bree-land": [
        "* Covell Woodwright is at [27.2S, 44.5W]"
    ],
    "Book 7, Instance: The Lost Workshop|Epic - Vol. II, Book 7: Leaves of Lórien": [
        "* I found the papers at the end of the workshop"
    ],
    "Book 7, Chapter 7: The Lost Workshop|Epic - Vol. II, Book 7: Leaves of Lórien": [
        "* The entrance to Melkólf Stonecarver's workshop is in Zirakzigil at [14.6N, 109.6W]"
    ],
    "The Strength of the Smith, Part II|Crafting": [
        "* Jon Whetstone's Notes are in your inventory. This will give you a hint in where to find the non-crafted component."
    ],
    "Purging the Plains|North Downs": [
        "* Warg Hunters and Dire Wargs are all over Nan Amlug."
    ],
    "Book 5, Chapter 3: The High Fortress|Epic - Vol. I, Book 5: The Last Refuge": [
        "* Head east then south to Gabilazan [28.0S, 0.8E]\n* The vault is on the right/west a short way inside\n* Defeat the mobs inside then inspect the cornerstone\n* Return to Glóin"
    ],
    "Book 6, Instance: New Devilry|Epic - Vol. II, Book 6: The Shadowy Abyss": [
        "* Fire Rogmul\n* Shadow Rogmul\n* The Gloom-walker\n* The Flame-drinker\n* Gwathnor"
    ],
    "Book 3, Chapter 1: An Overzealous Explorer|Epic - Vol. II, Book 3: The Lord of Moria": [
        "* Útrygg can be found at [6.7S, 104.4W]"
    ],
    "Book 1, Instance: The Watcher in the Water|Epic - Vol. II, Book 1: The Walls of Moria": [
        "* Make sure you have used the Scion scroll on your weapon or else you would not be able to damage the Watchers"
    ],
    "Book 1, Expedition: Orders for Half-orcs|Epic - Vol. II, Book 1: The Walls of Moria": [
        "* Filgogân is at [53.1S, 7.5W]\n* The pieces are marked in the instance map"
    ],
    "Book 1, Expedition: Danger Beneath the Surface|Epic - Vol. II, Book 1: The Walls of Moria": [
        "* The entrance to the Brackwater is at [50.3S, 5.2W]\n* Defeat Cave-lizard inside"
    ],
    "Dâr Narbugud: The Heart of the Scourge|Dungeons of Lothlórien": [
        "* Stand in the entrance of the Mistress' room (you don't even have to kill her), you'll get the white text message to use the item in inventory for the quest update."
    ],
    "Book 1, Chapter 14: Khazad-dûm At Last!|Epic - Vol. II, Book 1: The Walls of Moria": [
        "* Go into Moria, if it is too dark, turn up the Gamma in the Graphics in the Options Menu."
    ],
    "Book 1, Chapter 12: Forged Anew|Epic - Vol. II, Book 1: The Walls of Moria": [
        "* Once an Item Advancement weapon receives enough experience, it can be brought to a Forge-master to be reforged. Reforging such a weapon reveals its hidden potential."
    ],
    "Intro: The Storm is Upon Us|Introduction": [
        "* Talk to Jon Brackenbrook to enter the instance\n* Complete Instance: The Assault on Archet\n* Talk to Jon Brackenbrook in Archet"
    ],
    "Darkened by Mildew|Moria Lower Deeps": [
        "* The Fungus-covered Mirror is at [17.7S, 111.5W]"
    ],
    "Book 1, Chapter 10: Into the Barrow-downs|Epic - Vol. I, Book 1: Stirrings in the Darkness": [
        "* Go northeast into the Barrow-downs\n* Defeat Andraste and the crebain\n* Return to Tom Bombadil"
    ],
    "Bounty: Thauk, Vile Warg|Evendim": [
        "* Rowena Parker is in Ost Forod [7.3S, 64.3W]\n* You will find Thauk in Tum Fuin, north of Ost Forod [4.4S, 65.2W]"
    ],
    "Book 9, Foreword: News of the Palantír|Epic - Vol. I, Book 9: The Shores of Evendim": [
        "* Gandalf is in Bilbo's room on the ground floor of the Last Homely House, in Rivendell."
    ],
    "Book 9, Chapter 3: Journey to the Lone-lands|Epic - Vol. I, Book 9: The Shores of Evendim": [
        "* The Knight of Mordirith in the Lone-lands is Neacal (lvl 50 Signature with 4,428 morale) and can be found in Harloeg [39.2S, 25.1W]"
    ],
    "Book 8, Chapter 6: A Watchful Eye|Epic - Vol. I, Book 8: The Scourge of the North": [
        "* Aragorn in Rivendell in one of the guest rooms [30.7S, 6.2W]"
    ],
    "Book 8, Chapter 5: Mordirith's Fall|Epic - Vol. I, Book 8: The Scourge of the North": [
        "* This quest is meant for a fellowship. If you choose to undertake this quest solo you will receive an inspiration bonus, but the challenge will be great."
    ],
    "Book 8, Chapter 1: The Flickering Flame|Epic - Vol. I, Book 8: The Scourge of the North": [
        "* This quest is meant for a fellowship. If you choose to undertake this quest solo you will receive an inspiration bonus, but the challenge will be great."
    ],
    "Fallen Oak|Lone-lands": [
        "* Gloomleaf is located at [27.6S, 29.7W]"
    ],
    "Lost Dog|Evendim": [
        "* Roverandom @ Wikipedia.org\n* Roverandom @ Google Books\n* Roverandom @ Amazon.com"
    ],
    "Emyn Naer's Pests|Eregion": [
        "* Crawlers are found around Emyn Naer"
    ],
    "Leader of the Foul Wood|Eregion": [
        "* Zagâfum is found inside a cave Tawarond in Sâd Thareg [42.3N, 16.4W]\n* Quest:Instance: Leader of the Foul Wood"
    ],
    "Book 6, Chapter 6: Challenging the Stone|Epic - Vol. I, Book 6: Fires in the North": [
        "* Find one of the Watching-stones in the Ram Dúath. There at least 2 possible locations\nBetween Duvairë (Morroval) and Frith-vailë among the seige-engines (easiest to reach).\n* Between Bail Róva and Frith-vailë.\n* Use the stone & fight its spirit.\n* Return to Corunir in Aughaire."
    ],
    "A Final Act|Frostbluff": [
        "* This quest only shows up when the Deed Honoured Yule-friend is completed.\n* Talk to Albert Yule near the entrance of Winter-home.\n* Decide which quest to take."
    ],
    "Stop the Scouts|North Downs": [
        "* The Dourhand Scouts are scattered north of Othrikar."
    ],
    "Spirits in Bloom|Lothlórien": [
        "* Maliriel is at [17.2S, 64.0W]\n* Ambendel is at [14.3S, 73.1W]\n* Bahanneth is at [12.1S, 71.1W]"
    ],
    "Book 6, Chapter 4: Heart of Stone|Epic - Vol. I, Book 6: Fires in the North": [
        "* Head north out of Aughaire then west into Western Malenhad. Do not try and cross the line of standing statues in the middle - you will be defeated instantly. Displays the prompt \"The will of the Silent Watchers has overpowered you.  You do not yet have the strength to overcome their malice.  You succumb to your wounds.\"  Fallen statues can be found in various pools in Malenhad. There is one available at [0.4N, 31.2W].\n* After successfully collecting a heart return to Corunir."
    ],
    "Rituals of the Forest - Creeping Moss|Enedwaith": [
        "* [67.1S, 23.4W]\n* [67.2S, 23.5W]\n* [67.1S, 23.1W]\n* [67.0S, 23.0W]"
    ],
    "Dread in the Fallen City|Angmar": [
        "* The lesser watching-stones are found in Dûn Covád at:\n[6.1N, 38.7W]\n* [5.6N, 38.7W]\n* [5.3N, 38.2W]"
    ],
    "Strange Beasts|Angmar": [
        "* pending"
    ],
    "Honouring the Fallen|Eregion": [
        "* Barad Morlas is at [48.1S, 13.7W]\n* Statues can be found at:\n[47.9S, 13.6W]\n* [48.0S, 13.8W]\n* [47.7S, 13.4W]\n* [47.6S, 13.7W]\n* [48.5S, 13.8W]\n* [48.6S, 14.1W]\n* [48.5S, 14.2W]\n* [48.2S, 14.5W]\n* Shatogtar can be found at [47.9S, 13.9W]"
    ],
    "Treasure in the Ruins|Evendim": [
        "* Sid Waring can be found in a small island in Men Erain [15.3S, 66.2W]\n* Chests One and Two can be found at [15.7S, 66.3W]\n* Chests Three and Four can be found at [16.7S, 66.6W]"
    ],
    "Book 5, Chapter 6: In the Steps of Evil|Epic - Vol. I, Book 5: The Last Refuge": [
        "* Head north-east to some steps and a door on the east side of Northern Bruinen Source, some way below Helegrod itself. Do not enter the door.\n* Defeat & search the wights that appear on the steps.\n* Return to Glóin"
    ],
    "Rituals of the Forest - Mistletoe|Enedwaith": [
        "* [66.3S, 23.7W]\n* [66.6S, 23.2W]\n* [66.7S, 23.4W]\n* [66.7S, 23.6W]\n* [66.2S, 23.8W]\n* [66.4S, 23.5W]\n* [66.5S, 23.6W]\n* [66.7S, 23.8W]"
    ],
    "An End to the Poaching|Lothlórien": [
        "* If you complete Asmund's poaching quest, you will fail Limhendeth's one. If you turn in Limhendeth's quest, you will fail the poaching quest and won't be able to take any more poaching quests, should there be more."
    ],
    "Cleansing the Ruins|Ered Luin": [
        "* This quest can be a bit confusing because there is nothing to click on or highlight with the mouse, you'll need to either open your bag or hotkey the potion when the notice is given that you should use your potion. Then click on the cleansing potion just as you would any other potion.\n* The first tower is in Dol Ringwest around [24.8S, 94.9W]\n* The second tower is in Dol Ringwest around [24.8S, 95.1W]"
    ],
    "Spider-leg Prisms|Moria Lower Deeps": [
        "* Gabil-munz is at [16.5S, 114.0]"
    ],
    "Tad's Request|Reputation": [
        "* Ted is in Southern Bree ouside the Bree Hunting Lodge"
    ],
    "Fungus and Acid|Moria Lower Deeps": [
        "* The Great Wheel is at [17.7S, 115.6W]"
    ],
    "Book 7, Chapter 1: The Hill of Cerin Amroth|Epic - Vol. II, Book 7: Leaves of Lórien": [
        "* If you have not already completed Volume II, Book 6, it is encouraged, though not required, that you do so before beginning this quest."
    ],
    "Grain-buyer|North Downs": [
        "* Gatson is at [10.3S, 45.6W]"
    ],
    "Book 2, Chapter 11: The Stone-speaker|Epic - Vol. I, Book 2: The Red Maid": [
        "* Aric the Stone-speaker is in south Harloeg in Ost Haer"
    ],
    "Book 4, Instance: The Unmarked Trail|Epic - Vol. I, Book 4: Chasing Shadows": [
        "* Enter the instance.\n* Protect Legolas as he hunts for the evil.\n* Defeat Taushakh."
    ],
    "Book 2, Chapter 9: The Bloated Dead|Epic - Vol. I, Book 2: The Red Maid": [
        "* Several wights are in the Circle of Blood but there are more wights in east Haragmar"
    ],
    "Miraculous Growth -- Repeatable|Enedwaith": [
        "* [64.5S, 21.3W]\n* [64.2S, 21.3W]\n* [63.9S, 21.5W]\n* [63.5S, 22.0W]\n* [63.7S, 21.9W]\n* [63.1S, 22.7W]\n* [63.3S, 22.7W]\n* [63.4S, 22.6W]\n* [63.6S, 22.7W]\n* [63.6S, 22.8W]\n* [63.7S, 23.2]\n* [64.0S, 23.1]\n* [64.1S, 22.9]\n* [63.8S, 22.5]\n* [63.6S, 22.8]\n* [63.4S, 22.6]\n* [63.6S, 22.5]\n* [63.7S, 22.6]\n* [63.9S, 21.5]\n* [64.3S, 21.4]"
    ],
    "The Roosting Tree|Eregion": [
        "* The Roosting Tree is at [39.3S, 8.2W]"
    ],
    "A Smoking Fire|Mirkwood": [
        "* You can find Dry Branches in the Drownholt around [16.7S, 58.2W]"
    ],
    "Beastly Things|Forochel": [
        "* Kill Peikko and Savage Peikko in the Peikko Cave [9.5N, 79.9W]"
    ],
    "The Black-fire|North Downs": [
        "* You will find on of the crates in the northern hill [16.5S, 46.9W]\n* You will find on of the crates in the south-eastern hill [17.0S, 46.7W]\n* You will find on of the crates in the south-western hill [16.7S, 48.2W]"
    ],
    "Book 14, Chapter 1: The Long Road South|Epic - Vol. I, Book 14: The Ring-forges of Eregion": [
        "* Golodir at Gath Forthnír (leads to Chapter 1: The Heraldry of Lindon)\n* Filegnaneth in the Hall of Fire of the Last Homely House (leads to Chapter 1: Many Provisions)\n* Nat Collop, the Stable-master at Tinnudir in Evendim (leads to Chapter 1: The Steed Arel)"
    ],
    "Instance: A Spear at the Southern March|Warden": [
        "* This is a Solo quest, and cannot be completed with a Fellowship.\n* MAKE SURE TO TURN OFF FORCED MARCH AND REGEN POWER BEFORE STARTING.\n* For this quest, you will be asked to hold a line with one Warden NPC \"helping\" you. You will face 4 waves of 2-3 half-orcs or bandits each, with the last wave including a signature half-orc. The NPC will help you kill these enemies, but it's up to you to keep him from dying.\n* The best way to do that (without dying yourself) is to taunt 2 of the 3 enemies onto yourself and kill them while he's killing his one enemy. If you're well-equipped or slightly above-level, you can probably handle all three on you with little difficulty.\n* For the final wave, make sure the bigger enemy is on you, and not on the NPC. Otherwise handle this the same way."
    ],
    "Little Wonders|Enedwaith": [
        "* Small Arrow [64.3S, 22.2W]\n* Small Boots [61.3S, 19.2W]\n* Small Bucket [63.3S, 22.2W]\n* Small Skeleton [63.3S, 22.6W]\n* Small Tool [64.6S, 20.4W]\n* Small Bow [63.7S, 23.0W]"
    ],
    "In Honour of Love Deferred|Lothlórien": [
        "* The spot at which Elessar and Undómiel plighted their troth is at [12.0S, 67.8W]"
    ],
    "Cold as Death|Forochel": [
        "* Delucheleg can only be summoned by re-kindling the 3 braziers in Kibilzahar at the same time."
    ],
    "Book 2, Chapter 13: In the Gaunt-lord's Grasp|Epic - Vol. I, Book 2: The Red Maid": [
        "* Brudhraw is up the steps past the Bog-lord in Nindor"
    ],
    "Book 2, Chapter 12: A Dead Man's Challenge|Epic - Vol. I, Book 2: The Red Maid": [
        "* Emelin is in the same part of the ruins as Alric. After talking to him you must defeat 3 shades summoned by him."
    ],
    "Book 5, Chapter 2: Troublesome Goblins|Epic - Vol. I, Book 5: The Last Refuge": [
        "* Head east and a bit north to Pinnath Fenui\n* Defeat Gurzmat who is at the top of the hill and calls 1 add\n* Return to Glóin"
    ],
    "A Chill Wind|Forochel": [
        "* Ruaraikh can be found in the Ironspan at [16.7N, 60.9W]"
    ],
    "Defending the Herd|North Downs": [
        "* Defeat several waves of 3 Orcs each."
    ],
    "Book 2, Chapter 10: Breeders of the Dead|Epic - Vol. I, Book 2: The Red Maid": [
        "* The Gaunt-Men will usually generate several adds, so this quest is a bit more difficult than the preceding one."
    ],
    "Book 1, Chapter 9: Lilies for the River-daughter|Epic - Vol. I, Book 1: Stirrings in the Darkness": [
        "* Go down the hill into the river\n* Collect 4 large lilies\n* Return to Tom Bombadil"
    ],
    "He Who Leads|Forochel": [
        "* Nadelek can be found in Barad Gaurhoth at [11.5N, 82.5W]"
    ],
    "Circles of Silence|Lothlórien": [
        "* The Peaceful Glade is at [12.0S, 64.9W]\n* The Ring of Melbrethil is at [9.8S, 64.7W]\n* The Stone-grove is at [14.3S, 69.2W]\n* The Elder Circle is around [18.3S, 65.5W]"
    ],
    "Goblins in the Valley|Ered Luin": [
        "* Gazrîp is in Rath Teraig at [23.4S, 97.5W]"
    ],
    "Instance: Jail Break|Introduction": [
        "* Talk to Amdir.\n* Collect and equip weapons from the nearby lootable crate.\n* Talk to and follow Amdir.\n* Defeat Celandine Brandybuck's captors and talk to her.\n* Defeat Mundo's captor; talk to Mundo Sackville-Baggins.\n* Find and talk to Amdir.\n* Talk to Celandine Brandybuck to leave the instance."
    ],
    "Ablaze within Târ Stazg|Eregion": [
        "* The Târ Stazg Mustering Horn is in Târ Stazg, at [48.4S, 5.5W]"
    ],
    "Book 1, Chapter 6: In the Black Riders' Wake|Epic - Vol. I, Book 1: Stirrings in the Darkness": [
        "* Go down the hill from Lenglinn, there are Crebain there. Defeat them and return to Lenglinn"
    ],
    "Symbols of Conquest|Mirkwood": [
        "* There are Banners of Dol Guldur in Gathbúrz in all the Orc-camps and fortresses, as in [11.2S, 46.8W], [10.9S, 46.3W], [11.8S, 46.8W], [11.9S, 45.6W], [11.9S, 45.4W], [11.9S, 44.9W], [11.6S, 45.4W], [11.5S, 44.8W]"
    ],
    "Invaders of Barad Morlas|Eregion": [
        "* Barad Morlas is at [48.1S, 13.7W]"
    ],
    "An Unpleasant Meal|Evendim": [
        "* The Giant Stew-pot in Amon Mòth is at [8.9S, 75.0W]"
    ],
    "Villains in the Vale|Ered Luin": [
        "* The Blue-crag Chieftain can be found in Orodost at [20.4S, 102.1W]"
    ],
    "Vessel of Purity|Garth Agarwen": [
        "* Urn: This quest can be combined with several other Agamaur quests.  The Urn is at the top of several tiers of stairs, guarded by a 4.3k morale named elite.  It can only be taken by one person at a time, and requires the fellowship to wait around for it to respawn. The Urn of Agamur is in Agamaur at [29.6S, 29.5W]\n* Altar: Run due east from Dannasen, jinking around walls and through gates.  The altar does not flash like normal quest targets.  It is a blocky stone thing in a pool of red water, surrounded by dark-waters.  When standing next to it, you get a banner telling you to 'fill the urn'.  Right click on the urn in your inventory to do this. The Altar is in Agamaur at [29.7S, 25.5W].  Note that the altar is not inside Garth Agarwen."
    ],
    "Book 9, Instance: Oakheart's Might|Epic - Vol. I, Book 9: The Shores of Evendim": [
        "* Sara Oakheart is a lvl 50 Avenger with 44,284 morale. Just let her get the aggro of the spirits and help her beating on one of them.\n* Then just relax and watch the movie unwind.\n* You cannot avoid being defeated at the end of the instance."
    ],
    "Guardians of the Glade|North Downs": [
        "* [15.4S, 44.0W]\n* [14.5S, 43.8W]\n* [14.0S, 43.5W]"
    ],
    "One More Marker|Evendim": [
        "* This Stone Marker is guarded by many tomb-robbers. Across the clearing, there is a group of treasure-hunters, that will attack the tomb-robbers guarding the Stone Marker if you speak with their captain [9.5S, 73.0W]. You can either help the treasure hunters defeat the Tomb-robbers, or avoid getting aggro and complete the quest while they fight."
    ],
    "Blackwold Valuables|Bree-land": [
        "* The Blackwold Supervisor is at [27.9S, 44.1W]"
    ],
    "Venom of the Ruin-stalkers|Lone-lands": [
        "* Talk to Candac Brightwood at The Forsaken Inn"
    ],
    "The Raven|Forochel": [
        "* The raven is in Metsästä-sija at [1.6N, 60.9W]"
    ],
    "The Master of the Roost|Mirkwood": [
        "* The Summoning Horn to summon the Morvul Guard is in Dannenglor at [11.4S, 54.8W]"
    ],
    "Vanity|Moria Upper Levels": [
        "* The Mirror is in Dâr-rukh at [4.5S, 100.4W]"
    ],
    "Mockery|Lothlórien": [
        "* Târgrat can be found at Nardur-stazg camp [8.3S, 73.5W]"
    ],
    "Upon the Lonely Bank|Lothlórien": [
        "* The lonely tree is in Egladil at [17.2S, 63.6W]"
    ],
    "Flet-runner Challenge: Lintwen|Lothlórien": [
        "* You have 1 min 40 s to find the flet-runner"
    ],
    "Dark Raiders|Angmar": [
        "* Morfil is a cave located east of the Cairn of Honour"
    ],
    "An Errand for Millicent Greenlake|Crafting": [
        "* Supervisor Beecher is in Trestlebridge at [17.0S, 53.7W]"
    ],
    "Finding Reason|Bree-land": [
        "* Look for the cocoons on the wall"
    ],
    "Unpaid Debts|Bree-land": [
        "* The lockbox is at [27.9S, 44.7W] surrounded by several Blackwolds"
    ],
    "The Wayward Bull|Forochel": [
        "* The Wayward Bull can be found in Jä-rannit at [20.5, 72.4W]"
    ],
    "Cutting off the Hand|Lone-lands": [
        "* Reykur is found on the west side of Agamaur in the back."
    ],
    "The Frozen War|Forochel": [
        "* The Territory Markers can be found forming a line in Länsi-mâ at [13.6N, 84.8W], [13.9N, 84.5W], [14.2N, 84.3W], [14.2N, 83.8W], [14.2N, 83.3W], [14.6N, 82.9W]"
    ],
    "Churning Froth|Moria Lower Deeps": [
        "* The Great Wheel is at [17.7S, 115.6W]"
    ],
    "Little Revolution|Moria Upper Levels": [
        "* Zâhof's throne is in the south-eastern corner of Fehem-dûm at [4.3S, 104.0W]"
    ],
    "Troves and Trickery -- Duillond|Festival": [
        "* Emote: /look\n* Emote: /hail\n* Emote: /eat\n* Emote: /dance\n* Note: You cannot be mounted while performing this emote.\n* Emote: /handstand\n* Emote: /roar\n* Emote: /cower\n* Emote: /whippitydo"
    ],
    "Flet-runner Challenge: Bregradel|Lothlórien": [
        "* You have 55 s to find the flet-runner"
    ],
    "Trouble at Trestlebridge|Lone-lands": [
        "*"
    ],
    "Instance: The Ties That Bind|Forochel": [
        "* This is a solo quest, and cannot be completed with a Fellowship."
    ],
    "Treasure of the Lossoth|Forochel": [
        "* Rikitsa is at Sûri-kylä"
    ],
    "Elders in the Shadows|Lone-lands": [
        "* The Ruin-web Spinner and the Ruin-web Weaver can be found all throughout Amon Ros. They are fairly easy to find, and you will most likely stumble upon them by accident.\n* The Ruin-web Trapper is invisible and is usually found in a corner beneath the bridge or in the corner of the small ruined area on the ground level."
    ],
    "Spiders in the Quarry|Shire": [
        "* The spiders to kill are in the Scary Quarry east of Scary"
    ],
    "Empty Keg Emergency|Frostbluff": [
        "* Get the keg at the servant's area (by the oven).  Avoid watchers and bring it to the thirsty patron lazily lying down on the only keg outside of the servants' area."
    ],
    "Armies of the South|Eregion": [
        "* Gelirwen is at Echad Mirobel"
    ],
    "Riddles in the Sunshine|Moria": [
        "* Your reward is in a chest inside Ghâr-bayur, a cave locked with a door in Nanduhirion at [13.5S, 77.9W]"
    ],
    "Goblins and Spiders|Evendim": [
        "* The Corpse of Spider you are looking for at [22.5S, 64.3W], inside The Bleakleaf Crest"
    ],
    "Fangs Bared|Mirkwood": [
        "* You need to defeat wolves around Hrigg Vidukuni to summon him. Careful, he will come with a couple adds, making this quest a hard solo quest."
    ],
    "A Mischievous Breeze|Lothlórien": [
        "* 15.3S, 67.7W (Behind crafting hall)\n* 14.6S, 67.8W (Telain Melthin, top level)\n* 14.8S, 67.8W (Telain Bangad, 2nd level)\n* 15.1S, 67.8W (Telain Bangad on crosswalk, 2nd level)\n* 15.1s, 67.8w (Telain Bangad, 3rd level)"
    ],
    "Rumming's Resolute Resolve|Evendim": [
        "* The answer to the riddle is \"Warg\". The Chest of the Warg can be found at [12.4S, 72.0W]"
    ],
    "Time for a New Shield|Forochel": [
        "* Rauno is inside the Great Lodge of Sûri-kylä\n* Kill bears and worms around Sûri-kylä"
    ],
    "Half-breed Thieves|Lone-lands": [
        "* The relics are in Naerost"
    ],
    "Intro: Honing Your Skills|Introduction": [
        "* Talk to your class trainer\n* Complete your class-specific training quest\n* Return to Strider"
    ],
    "Collecting History|Great Barrows": [
        "* The chalices are inside the three Great Barrow instances: Thadúr, Maze, and Sambrog"
    ],
    "Chief of the Invaders|Eregion": [
        "* The Barad Morlas Mustering-horn is at [48.0S, 13.7W]"
    ],
    "Three Sheets to the Wind|Forochel": [
        "* Tundra Bears drop the first sheet\n* Any peikko in the Peikko Cave drops the second sheet\n* Gauradan Hunters drop the third sheet"
    ],
    "On the Road to Misfortune|Forochel": [
        "* Kill any Gauradan for the map"
    ],
    "Things Left Behind|Eregion": [
        "* You will find a Pipeweed Pouch at an abandoned camp in the High Hollin area [43.8S, 12.9W]"
    ],
    "The Yule Celebration of Winter-home|Frostbluff": [
        "* The Mayor is north of Albert Yule.\n* The Mayor's Wife is beside him.\n* Cecil Voller is north of town in the Snowball Field.\n* Mabel Mitford is north of the Mayor.\n* Guard Kember patrols the entrance of town.\n* The hobbit-announcer is square in the middle of town by the Festival Theater door.\n* Ona Kay is south of the Mayor.\n* Gareth Rust and Daley Utteridge is in the south-west corner of town.\n* Return to the Mayor."
    ],
    "Fortuitous Timing|Moria Upper Levels": [
        "* The Statue-arm is in Sulnul-dûm at [3.1S, 107.8W]"
    ],
    "Egg-collectors|Eregion": [
        "* A nice concentration of half-orcs can be found at Pembar."
    ],
    "The Thief of Dannenglor|Mirkwood": [
        "* The Greedy Morroval-thief is by the Dark Gap in Dannenglor at [12.4S, 54.6W]"
    ],
    "Rank and File|Angmar": [
        "* The banners are in Bail Dílas"
    ],
    "The Worm-keeper|Eregion": [
        "* Arzgât is in Carchres [42.2S, 9.4W]"
    ],
    "The Darkness Within|Fornost": [
        "* The hilts do not stack, and therefore the player will need four available inventory slots to carry the hilts until the quest is completed.\n* The Elite Master and Nemesis level bosses that drop these hilts are Megoriath, Rhavameldir, Brogadan, and Remmenaeg.\n* The hilts are named after the creature that drops them."
    ],
    "Posco's Uncle|Bree-land": [
        "* Filbert is at [27.0S, 42.9W]\n* Cole Sickleleaf is at [28.6S, 46.0W]\n* Then return to Filbert, then talk to Posco"
    ],
    "The Tincture|Angmar": [
        "* The nightshade-plants are in Gorothlad around [1.4N, 20.9W]"
    ],
    "Delaying Aid|Eregion": [
        "* Târ Stazg is north-east of Echad Dúnann along the mountains before the Redhorn Gate."
    ],
    "A Poultice for Our Hurts|Angmar": [
        "* pending"
    ],
    "Book 5, Chapter 7: Evil Tidings|Epic - Vol. I, Book 5: The Last Refuge": [
        "* Walk back to Rivendell and speak with Elrond."
    ],
    "The Thieves' Trail|Eregion": [
        "* Thlûk is still in the Tâl Caradhras area [48.1S, 8.7W]"
    ],
    "The Root of the Problem|Forochel": [
        "* Ringdagnir can be found in the sulfur pools of Länsi-mâ at [10.5N, 82.8W]"
    ],
    "Book 9, Chapter 4: First Offensives|Epic - Vol. II, Book 9: Fortress of the Nazgûl": [
        "* This quest involves a Skirmish that can be completed at Solo, Small Fellowship, Fellowship, or Raid group sizes by using the Skirmish Join Panel. This Skirmish has a minimum level of 60.\n* Before launching the Skirmish, you should visit one of the Skirmish Camps found throughout Middle-earth and speak with a Skirmish Captain to properly train. Skirmish Camps can be found in the following regions: Ered Luin, Bree-land, the Shire, the Lone-lands, the North Downs, the Trollshaws, Evendim, Forochel, Angmar, Eregion, Moria, and Lothlórien."
    ],
    "Crafting: The Maker's Hall|Crafting": [
        "* Egil Oldbeard is in the area before Forging Hall of Thorin's Hall"
    ],
    "Implements of Song|Minstrel": [
        "* Baillindiel will give us her notes on the items we need."
    ],
    "Instance: A Road Through the Dark|Introduction": [
        "* Talk to Postman Took\n* Leave the Post Office\n* Talk to Bounder Boffin, get equipment\n* Follow Boffin, fight spiders\n* Talk to Gildor Inglorion\n* Talk to Amdir"
    ],
    "A Rare Vintage|Ered Luin": [
        "* Collect wine-flasks (0/6) from the goblins in Limael's Vinyard\n* Bring the wine-flasks back to Brethilwen"
    ],
    "The Terrible Secret of the Salamanders|Evendim": [
        "* The door in the ruins near Humfrey Rumming can be opened with the key he will give you. Both Salamanders are at the basement."
    ],
    "The Strength of the Smith, Part IV|Crafting": [
        "* You can collect a deep-iron nugget at the Bruinen Source East [22.8S, 1.9E]"
    ],
    "Dwarves and Mammoths|Forochel": [
        "* Thórth is at Zigilgund, take the road west from Pynti-peldot"
    ],
    "Venturing Forth|Forochel": [
        "* Ora is at Pynti-peldot at the other side of the gorge"
    ],
    "Claiming the Jewel|Forochel": [
        "* Roibeard, who holds the Jewel of Ice, can be found deep into the Ironspan at [16.5N, 60.6W]"
    ],
    "The Council of the North|Reputation": [
        "* Talk to Annábla in Gath Forthnír"
    ],
    "The Stone-speaker|Lone-lands": [
        "* Aric the Stone-speaker is at Ost Haer [37.5S, 28.1W]"
    ],
    "The Last Farm|North Downs": [
        "* Talk to Orthonn [9.4S, 47.3W]\n* Return to Gatson"
    ],
    "Pickthorn's Treasure|Bree-land": [
        "* Dig the stumps at Stump Field, then return to Ted"
    ],
    "The Lost Tool|Ered Luin": [
        "* The Winterheight is in Thorin's Gate at [15.8S, 101.7W]\n* When you are almost at the bottom you can find the pick axe.\n* Kill the required amount of cave-claws."
    ],
    "A Cloud of Bats|Mirkwood": [
        "* The Stolen Satchel is in Gorotham, at the same spot where Carcharan spawn [12.3S, 57.7W]"
    ],
    "The Burning Island|Evendim": [
        "* To complete this quest you must speak with Humfrey Rumming at Tyl Ruinen [11.7S, 72.0W]"
    ],
    "The Seven Swords|Angmar": [
        "* the Sword of Abb from Owen [1.8N, 24.6W]\n* the Sword of Kolmak from Ruraikh [2.2N, 25.6W]\n* the sword of Ánraig from Tobaid [2.3N, 27.8W]\n* the sword of Guinokh from Brekhin [3.7N, 27.4W]\n* the sword of Innis from Dugald [0.6S, 26.2W]\n* the sword of Kevoka from Frangan [0.9S, 24.9W]\n* the sword of Mánas from Huisdán [0.4S, 24.5W]"
    ],
    "A Lost Necklace|Lothlórien": [
        "* Hadhelen is at [9.8S, 64.7W]\n* Aesbrennil is at [9.8S, 64.7W]\n* Farasdúr is at [18.3S, 64.1W]\n* Glasnír is at [18.3S, 64.1W]"
    ],
    "Challenge: Grimbark|Garth Agarwen": [
        "* For tactics on Grimbark, see Grimbark.\n* The fight will be harder on the Warden since the majority of the Fist Gambits are AoE taunt dots.  This means that the beehives might be accidentally affected with the taunt dots."
    ],
    "The Elves of Eregion|Trollshaws": [
        "* Daegennan is at Gwingris in Eregion"
    ],
    "In the Dark Clefts|Angmar": [
        "* The Earth-kin Scout is at [3.8S, 36.3W]"
    ],
    "Balin's Pride|Moria Upper Levels": [
        "* Balin's Camp is at [5.8S, 103.9W], and can only be reached by the way that crosses the Deep Crossroad"
    ],
    "The Scent of Mithril|Angmar": [
        "* Arngrim is at Imlad Balchorth [4.5N, 27.3W]"
    ],
    "Elessar and Undómiel|Lothlórien": [
        "* Pennasseth is at Cerin Nauth [12.8S, 70.1W]\n* Meluibrennil is at Bain Gwaloth [13.0S, 67.2W]\n* Naeris is at The Peaceful Glade [12.0S, 64.9W]"
    ],
    "Another Thin Winter|Forochel": [
        "* Moose (Shaggy Frost-antler and Shaggy Bull Frost-antler) roam all over Itä-ma, near and far from Jänis-leiri."
    ],
    "Some Kind of Safety|Moria Lower Deeps": [
        "* You don't need to go far to test the water. The water at the base of the stairs [15.3S, 112.4W] going down from The Rotting Cellar will do. There, you must use the White Cloth Strip from your inventory."
    ],
    "Snapper Soup|Bree-land": [
        "* Collect 5 Snapper-shells and 15 Chunks of Snapper-meat from the Snapper Turtles around Nen Harn in northeast Bree-land.\n* Return them to Emma."
    ],
    "A Brother's Plea|North Downs": [
        "* Oskari [8.9S, 32.6W] is at the back of a Rauta-lehmä camp in Fashat Laug"
    ],
    "The Path to Learning, Part II|Crafting": [
        "* The Lost Stanzas of Aiglos can be found in a brown satchel on the ground in the North Downs [7.8S, 49.6W]"
    ],
    "Coat of Shadow|North Downs": [
        "* Collect Harrow Weed\n* [9.3S, 37.1W]\n* [9.7S, 36.9W]\n* [9.9S, 36.8W]\n* [9.8S, 36.4W]\n* [9.8S, 36.6W]\n* [9.4S, 36.8W]\n* [9.9S, 36.6W]\n* Collect Dire Warg hides:"
    ],
    "The Paths of Caras Galadhon|Lothlórien": [
        "* Once you get to Friend with the Galadhrim, you will get this quest from the Galadhrim Guard outside Caras Galadhon and after talking with him again you will gain access to the city of the Elves."
    ],
    "A Fool's Hope|Eregion": [
        "* You will find some Redhorn-goat Meat in the Redhorn Gate at [47.2, 3.5W]"
    ],
    "Pursued by the Past|Lone-lands": [
        "* Head to the Eastern side of Harloeg & kill trolls - you will find Balt-olog Crusher & Balt-olog Heaver\n* Return to Kekkonen"
    ],
    "Orcs in the Ram Dúath|Angmar": [
        "* There are a number of Orcs to the south-east of the camp that can be pulled and taken down solo. You may need to wait for them to respawn once or twice, since the ones at the Catapults tend to pull in groups of 3-5 and can be very difficult to take down alone."
    ],
    "The Orc Threat|North Downs": [
        "* Defeat Orcs just south of his farm."
    ],
    "Dwindling Hope|Mirkwood": [
        "* The Defiled Remains of the first scout are in Dannenglor at [11.5S, 54.7W]\n* The Defiled Remains of the second scout are in Dannenglor at [11.6S, 55.2W]\n* The Defiled Remains of the third scout are in Dannenglor at [12.4S, 54.7W]"
    ],
    "A Threat from Spiders|Bree-land": [
        "* Brood Lurkers will ignore you unless you attack them first, but keep an eye out for Brood Weavers dropping down from the trees."
    ],
    "The Half-orcs' Beasts|Eregion": [
        "* Barad Morlas is at [48.1S, 13.7W]"
    ],
    "Bitter Scenes in Audaghaim|Mirkwood": [
        "* There is evidence of violence in Audaghaim at [14.1S, 55.4W]\n* There are old weapons in Audaghaim at [13.9S, 54.9W]\n* There is a sign of the Necromancer's influence in Audaghaim at [13.2S, 54.8W]"
    ],
    "The Glowering Trees of the Drownholt|Mirkwood": [
        "* Nífdir is in the Drownholt at [18.3S, 57.4W]"
    ],
    "Quelling the Storm|Eregion": [
        "* You will find the clues on some Burnt Camp-fire Logs in the Redhorn Snowfall at [46.6, 2.7W]\n* The campfire is surrounded by 4 non-aggressive Freezing Grim.\n* To reach the campfire, head as far up the snow slope as possible and look for a ledge on the left."
    ],
    "Restoring the Peas|Angmar": [
        "* Pea plants can be found at [5.7N, 36.1W] and [5.5N, 35.1W]"
    ],
    "Under Attack|Forochel": [
        "* The Kantâ-vilkku (or Snow Beacon) is in Jä-rannit at [18.2N, 66.7W]. The Broken Snow Beacon Supply Crate you must inspect are by the beacon."
    ],
    "Instance: The Matron and the Master|Angmar": [
        "* Kill the waves of Brutal Hill-beasts, then kill Bangrath and Murragrath."
    ],
    "The Vigil|Bree-land": [
        "* The Vance Waithman and thieves are at [30.5S, 47.6W]"
    ],
    "Banners of the Pass|Eregion": [
        "* The Redhorn Gate is north-east of Echad Dúnann."
    ],
    "Oatmeal Problems|Lone-lands": [
        "* Nod Gardener is at Oatbarton in Evendim"
    ],
    "The Finest Melody is Understanding|Minstrel": [
        "* Baillindiel is at Celondim by the docks"
    ],
    "Where Norsu Die|Forochel": [
        "* The Mammoth Corpse can be found in Norsu-hauta at [7.8N, 81.1W]"
    ],
    "Long Overdue Justice|Garth Agarwen": [
        "* The Créoth's are inside the instance Garth Agarwen: Fortress"
    ],
    "Book 6, Chapter 7: Beyond Rammas Deluon|Epic - Vol. I, Book 6: Fires in the North": [
        "* Talk to Braigiar at Gabilshathûr."
    ],
    "The Errant Coinpurse|Bree-land": [
        "* Collect Lolo Wendingway's pack from the bears east of Lolo\n* Bring the pack to Lolo Wendingway"
    ],
    "The Second Gear|Ered Luin": [
        "* The second gear is in a Chest in Orodost at [20.6S, 102.4W]"
    ],
    "Stuffing the Stuffed|Frostbluff": [
        "* Winterberries can be found all over Frostbluff outside of town.\n* Eggs can be found in the chicken coop called Cluckland in the north of the middle of Frostbluff.\n* Mushrooms can be found in the mushroom tent in the south of the middle of Frostbluff.\n* The servants' oven to make the bread is located a step up from the town's northern exit."
    ],
    "Rurik Fennel, Locksmith|Bree-land": [
        "* The Blackwold Supervisor is at [27.9S, 44.1W]"
    ],
    "The Defence of House Brumbar|Evendim": [
        "* Pantescal is at [10.4S, 66.3W]"
    ],
    "The Crebain of Caradhras|Eregion": [
        "* The crebain are scattered at Tâl Caradhras"
    ],
    "Hungry Bear-friend|Forochel": [
        "* The moose are around the southwestern area of the lake"
    ],
    "Driving the Beasts Out|Forochel": [
        "* The red-fang behemoth can be found in Metsästä-sija at [1.4N, 61.2W].\n* Remember to use the Warg Fat Totem you have in your inventory."
    ],
    "An Ornate Necklace|Eregion": [
        "* Bring the necklace to Ladenthir in Echad Eregion"
    ],
    "Earned Trust|Lone-lands": [
        "* Frideric the Elder is in Ost Guruth [31.5S, 29.5W]"
    ],
    "Rituals of the Forest - Oaken Limbs|Enedwaith": [
        "* [68.1S, 24.8W]\n* [67.8S, 24.8W]\n* [67.8S, 24.9W]\n* [67.4S, 24.9W]\n* [67.3S, 25.0W]\n* [67.0S, 24.7W]"
    ],
    "Articles of Harmony|Minstrel": [
        "* Baillindiel will give us her notes on the items we need."
    ],
    "The Battle for Aughaire|Angmar": [
        "* For a walkthrough and other information on the instance, see the Battle for Aughaire."
    ],
    "The Search for a Remedy|Mirkwood": [
        "* The plants and herbs can be found around the pools in the Drownholt around [17.4S, 56.1W]"
    ],
    "Birds of a Feather|North Downs": [
        "* Falconer Brúni is at [5.3S, 43.2W] and comes with 2 adds"
    ],
    "Treasures from Barad Morlas|Eregion": [
        "* Barad Morlas is at [48.1S, 13.7W]"
    ],
    "Sweet Water|Lothlórien": [
        "* The spring with the buckets in Egladil is at [18.3S, 65.6W]"
    ],
    "Instance: The Fall of Moria|Moria": [
        "* When you get to the mines, kill Crazed Deep-claw and Maddened Cave-claw"
    ],
    "The Elf-sword|Ered Luin": [
        "* The Elf-friend Sword is in Emyn Hoedh at [18.7S, 93.8W]"
    ],
    "Terror of the Drownholt|Mirkwood": [
        "* To summon Mirefang, inspect a Freshly-mauled Corpse in the Pool of Creeping Death at [16.7S, 57.7W]"
    ],
    "In Pursuit|Moria": [
        "* Kambi is in The Great Delving at [7.7S, 114.7W]\n* If you find him, you'll be attacked by a goblin, Chieftain Lûrkh. He is a normal goblin and should not cause too much trouble to defeat."
    ],
    "Burning Drûmaudhul|Lothlórien": [
        "* The Drûmaudhul Banner is in Drûmaudhul at [10.2S, 72.6W]"
    ],
    "Spoiling the Spoils|Eregion": [
        "* Pembar is at [44.1S, 10.8W]\n* Worm-eggs can be found at:\n[44.2S, 10.7W]\n* [44.2S, 10.8W]\n* [44.1S, 10.8W]\n* [44.0S, 10.9W]\n* [43.9S, 10.7W]\n* [44.0S, 10.7W]\n* [44.0S, 10.6W]\n* [44.1S, 10.6W]\n* [44.1S, 11.0W]\n* [44.2S, 10.9W]\n* [43.8S, 10.9W]\n* [44.3S, 10.6W]"
    ],
    "Book 5, Chapter 4: The Key-stone|Epic - Vol. I, Book 5: The Last Refuge": [
        "* Head north into Bruinen Source West\n* Collect the key from a chest at Iskeld's Lookout [21.5S, 4.6W]\n* Return to Glóin"
    ],
    "Into the Ram Dúath|North Downs": [
        "* Chief Tuokki is at Lehmä-koti in Angmar. Use the right Ram Dúath road."
    ],
    "The Spy-master|Eregion": [
        "* Pizumu the Spy-master can be found at Cirth Narugorch [45.6S, 7.2W]"
    ],
    "First Age Relics - Introduction|Reputation": [
        "* First Age Relics drop from Dourhands in the Icereave Mines and everything in Sarnúr"
    ],
    "Seeds for the Future|Eregion": [
        "* Holly-seeds can be found on the bushes growing underneath the trees in Glâd Ereg, south of Gwingris. Celebrandir has asked you to collect holly-seeds for him, so that he may begin replanting the wood."
    ],
    "Death to the Puny Mine-dwellers|Moria Upper Levels": [
        "* The Durub Shrine in Gazatu-ru where you must plant the banner is at [8.1S, 105.2W]"
    ],
    "Sealing the Barrows|Mirkwood": [
        "* The Barrow of Brungúr is in the Shrine of the Ancient One at [11.7S, 47.9W]\n* The Barrow of Thorún is in the Shrine of the Ancient One at [11.4S, 48.0W]\n* The Barrow of Mordeloth is in the Shrine of the Ancient One at [11.3S, 48.3W]"
    ],
    "Crafting: Seward Proudfoot's First Breakfast|Crafting": [
        "* Collect Eggs and Onions (0/5)\n* Collect Hard Biscuits (0/5)"
    ],
    "Fell Spirits|Garth Agarwen": [
        "* Gloom-waters can be found the in Garth Agarwen area and near the Garth Agarwen instance entrances.\n* They can also be found inside the instances Garth Agarwen: Arboretum and Garth Agarwen: Fortress."
    ],
    "Book 5, Chapter 5: The Last Refuge|Epic - Vol. I, Book 5: The Last Refuge": [
        "* Talk to Gimli to start the instance\n* Defeat enemies (Dourhands and Frost Giants) & protect Gimli\n* Defeat Skorgrím Dourhand\n* Talk to Glóin"
    ],
    "A Stare from the Wild|Forochel": [
        "* Blökk is on the southwestern shore of the lake"
    ],
    "Profound Losses|Lone-lands": [
        "* The egg sacs are in Amon Ros"
    ],
    "Battle of the Snowballs (Hard)|Frostbluff": [
        "* Hit players with the snowballs while in the Snowball Field.  Players that can be hit do not have to be participating.\n* It's not necessary to barter snowballs first, it's also possible to make them at The Snowball Field."
    ],
    "Fuel for the Forge|Angmar": [
        "* The Angmar Coal is in the canyon north of Donnvail [8.0N, 35.5W]"
    ],
    "Dark Idols|Mirkwood": [
        "* There are Dark Idols in Gathbúrz at [13.0S, 45.0W],  [13.5S, 44.8W], [14.4S, 44.7W], [14.8S, 45.6W], [14.3S, 46.3W]"
    ],
    "Book 8, Instance: Escape from Rushdurinul|Epic - Vol. II, Book 8: Scourge of Khazad-dûm": [
        "* This is a solo quest, and cannot be completed with a Fellowship.\n* You can use the banner that Bróin will plant to get some nice buffs from your companions, but they must be renewed every time your party moves and Bróin plants the banner again.\n* You can switch the support role of your companions even in midfight."
    ],
    "An Honourless People|Lone-lands": [
        "* Daegwalt is at Ost Guruth"
    ],
    "A Plague of Spiders|Lone-lands": [
        "* The spiders are in Amon Ros, west of Ost Guruth"
    ],
    "A Banner Day|Mirkwood": [
        "* There are Orc War-banners around the Orc camps in Taur Morvith, at [17.0S, 50.8W],  [17.1S, 50.4W], [17.3S, 50.6W], [17.3S, 50.9W], [17.1S, 50.1W], [16.9S, 50.3W]"
    ],
    "Angmar's Dead|Lone-lands": [
        "* The gaunt-men are found on the west side of Agamaur."
    ],
    "Predators in the Foothills|Angmar": [
        "* Scara Hunters, Scara Corpse-ravagers, and Scara Skulkers are in Fasach-larran"
    ],
    "Pipe-weed Delivery|Bree-land": [
        "* Roger is at Adso's camp, west of Bree (just take the road west)"
    ],
    "False Wards|Evendim": [
        "* 1st ward is located at [5.6S, 71.9W]\n* 2nd ward is located at [5.4S, 72.5W]\n* 3rd ward is located at [6.1S, 73.2W]\n* 4th ward is located at [6.6S, 73.7W]\n* 5th ward is located at [6.6S, 74.2W]"
    ],
    "Crafting: Mudbottom's High Standards|Crafting": [
        "* Collect mushroom pie (0/2)"
    ],
    "Out of the Darkness|Moria Lower Deeps": [
        "* Kraibag is in The Chamber of Dark Waters [16.1S, 111.9W]"
    ],
    "Book 9, Chapter 2: Rumour of Mazog|Epic - Vol. II, Book 9: Fortress of the Nazgûl": [
        "* There is an Orc Leader's Coffer in Maudhûl-ulur at [17.4S, 60.0W] where you can find a report for Mazog.\n* There is an Orc Leader's Coffer in Ashúrz Maufulug at [18.4S, 60.9W] where you can find a report for Mazog."
    ],
    "A New Shine|Ered Luin": [
        "* Geitir is in Noglond at [19.3S, 100.5W]\n* Óláfr is in Noglond at [19.4S, 100.5W]"
    ],
    "Instance: The Rite of Clúcath|Angmar": [
        "* pending"
    ],
    "Bounty: Andy Idden, Goblin-friend|Evendim": [
        "* Poppy Seaton is in Ost Forod [7.5S, 64.5W]"
    ],
    "Master of the Lash|Lone-lands": [
        "* Orcs to kill are in Ost Cyrn"
    ],
    "The Fifth Gear|Ered Luin": [
        "* The Chest is in Talath Ondren at [18.9S, 91.0W]. It is near the brood mother, in some shallow water next to some large rocks."
    ],
    "A Light in the Garden|Moria Upper Levels": [
        "* The mirror is in Tharâkh Bazân at [3.6S, 109.1W]"
    ],
    "A Healing Hand|Enedwaith": [
        "* [63.3S, 16.6W]\n* [63.2S, 16.5W]\n* [63.1S, 16.5W]\n* [63.6S, 18.5W]\n* [63.4S, 18.3W]\n* [63.5S, 18.5W]\n* [62.3S, 16.3W]\n* [62.1S, 16.2W]\n* [62.3S, 16.0W]\n* [62.5S, 17.0W]\n* [62.3S, 16.1W]\n* [63.8S, 16.2W]\n* [64.4S, 16.2W]\n* [64.6S, 16.1W]\n* [64.6S, 16.0W]"
    ],
    "Lines of Power|Moria Upper Levels": [
        "* The first Fungus Cluster to be examined is at [8.7S, 103.5W]\n* The second Fungus Cluster to be examined is at [8.9S, 102.5W]\n* The third Fungus Cluster to be examined is at [8.6S, 100.5W]"
    ]
}